# Comparing `tmp/composabl-0.3.0-cp38-cp38-musllinux_1_1_x86_64.whl.zip` & `tmp/composabl-0.3.1-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,11 +1,13 @@
-Zip file size: 35357 bytes, number of entries: 9
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 04:06 composabl.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 04:06 composabl-0.3.0.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-03 04:06 composabl/
--rw-r--r--  2.0 unx       57 b- defN 23-Aug-03 04:06 composabl-0.3.0.dist-info/entry_points.txt
--rw-r--r--  2.0 unx       10 b- defN 23-Aug-03 04:06 composabl-0.3.0.dist-info/top_level.txt
--rw-rw-r--  2.0 unx      517 b- defN 23-Aug-03 04:06 composabl-0.3.0.dist-info/RECORD
--rw-r--r--  2.0 unx     1837 b- defN 23-Aug-03 04:06 composabl-0.3.0.dist-info/METADATA
--rw-r--r--  2.0 unx      111 b- defN 23-Aug-03 04:06 composabl-0.3.0.dist-info/WHEEL
--rwxr-xr-x  2.0 unx    88304 b- defN 23-Aug-03 04:06 composabl/__init__.cpython-38-x86_64-linux-gnu.so
-9 files, 90836 bytes uncompressed, 34095 bytes compressed:  62.5%
+Zip file size: 98893 bytes, number of entries: 11
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-04 19:36 composabl.libs/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-04 19:36 composabl-0.3.1.dist-info/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-04 19:36 composabl/
+-rw-r--r--  2.0 unx       57 b- defN 23-Aug-04 19:36 composabl-0.3.1.dist-info/entry_points.txt

- <1><105>: Abbrev Number: 5 (DW_TAG_typedef)
-    <106>   DW_AT_name        : (strp) (offset: 0x2cc5): wchar_t
-    <10a>   DW_AT_decl_file   : (data1) 3
-    <10b>   DW_AT_decl_line   : (data1) 18
-    <10c>   DW_AT_decl_column : (data1) 13
-    <10d>   DW_AT_type        : (ref4) <0xe6>, int
- <1><111>: Abbrev Number: 8 (DW_TAG_variable)
-    <112>   DW_AT_name        : (strp) (offset: 0x2960): optarg
-    <116>   DW_AT_decl_file   : (data1) 6
-    <117>   DW_AT_decl_line   : (data1) 123
-    <118>   DW_AT_decl_column : (data1) 14
-    <119>   DW_AT_type        : (ref4) <0xda>, char
-    <11d>   DW_AT_external    : (flag_present) 1
-    <11d>   DW_AT_declaration : (flag_present) 1
- <1><11d>: Abbrev Number: 8 (DW_TAG_variable)
-    <11e>   DW_AT_name        : (strp) (offset: 0x124e): optind
-    <122>   DW_AT_decl_file   : (data1) 6
-    <123>   DW_AT_decl_line   : (data1) 124
-    <124>   DW_AT_decl_column : (data1) 12
-    <125>   DW_AT_type        : (ref4) <0xe6>, int
-    <129>   DW_AT_external    : (flag_present) 1
-    <129>   DW_AT_declaration : (flag_present) 1
- <1><129>: Abbrev Number: 8 (DW_TAG_variable)
-    <12a>   DW_AT_name        : (strp) (offset: 0x2040): opterr
+    <c>   DW_AT_producer    : (strp) (offset: 0xa1d): GNU C17 10.2.1 20210130 (Red Hat 10.2.1-11) -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
+    <10>   DW_AT_language    : (data1) 12	(ANSI C99)
+    <11>   DW_AT_name        : (strp) (offset: 0x84b): dist/build_cython/composabl/__init__.c
+    <15>   DW_AT_comp_dir    : (strp) (offset: 0x1420): /project/composabl
+    <19>   DW_AT_ranges      : (sec_offset) 0x720
+    <1d>   DW_AT_low_pc      : (addr) 0
+    <25>   DW_AT_stmt_list   : (sec_offset) 0
+ <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2a>   DW_AT_name        : (strp) (offset: 0xe4c): size_t
+    <2e>   DW_AT_decl_file   : (data1) 3
+    <2f>   DW_AT_decl_line   : (data1) 209
+    <30>   DW_AT_decl_column : (data1) 23
+    <31>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+ <1><35>: Abbrev Number: 3 (DW_TAG_base_type)
+    <36>   DW_AT_byte_size   : (data1) 8
+    <37>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <38>   DW_AT_name        : (strp) (offset: 0x1a2a): long unsigned int
+ <1><3c>: Abbrev Number: 3 (DW_TAG_base_type)
+    <3d>   DW_AT_byte_size   : (data1) 1
+    <3e>   DW_AT_encoding    : (data1) 8	(unsigned char)
+    <3f>   DW_AT_name        : (strp) (offset: 0x783): unsigned char
+ <1><43>: Abbrev Number: 3 (DW_TAG_base_type)
+    <44>   DW_AT_byte_size   : (data1) 2
+    <45>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <46>   DW_AT_name        : (strp) (offset: 0x115c): short unsigned int
+ <1><4a>: Abbrev Number: 3 (DW_TAG_base_type)
+    <4b>   DW_AT_byte_size   : (data1) 4
+    <4c>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <4d>   DW_AT_name        : (strp) (offset: 0x1a2f): unsigned int
+ <1><51>: Abbrev Number: 3 (DW_TAG_base_type)
+    <52>   DW_AT_byte_size   : (data1) 1
+    <53>   DW_AT_encoding    : (data1) 6	(signed char)
+    <54>   DW_AT_name        : (strp) (offset: 0x785): signed char
+ <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
+    <59>   DW_AT_byte_size   : (data1) 2
+    <5a>   DW_AT_encoding    : (data1) 5	(signed)
+    <5b>   DW_AT_name        : (strp) (offset: 0x1e56): short int
+ <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
+    <60>   DW_AT_byte_size   : (data1) 4
+    <61>   DW_AT_encoding    : (data1) 5	(signed)
+    <62>   DW_AT_name        : (string) int
+ <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
+    <67>   DW_AT_byte_size   : (data1) 8
+    <68>   DW_AT_encoding    : (data1) 5	(signed)
+    <69>   DW_AT_name        : (strp) (offset: 0x1c77): long int
+ <1><6d>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6e>   DW_AT_name        : (strp) (offset: 0x26d): __off_t
+    <72>   DW_AT_decl_file   : (data1) 4
+    <73>   DW_AT_decl_line   : (data1) 140
+    <74>   DW_AT_decl_column : (data1) 25
+    <75>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><79>: Abbrev Number: 2 (DW_TAG_typedef)
+    <7a>   DW_AT_name        : (strp) (offset: 0x11da): __off64_t
+    <7e>   DW_AT_decl_file   : (data1) 4
+    <7f>   DW_AT_decl_line   : (data1) 141
+    <80>   DW_AT_decl_column : (data1) 27
+    <81>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><85>: Abbrev Number: 5 (DW_TAG_pointer_type)
+    <86>   DW_AT_byte_size   : (data1) 8
+ <1><87>: Abbrev Number: 2 (DW_TAG_typedef)
+    <88>   DW_AT_name        : (strp) (offset: 0xe49): __ssize_t
+    <8c>   DW_AT_decl_file   : (data1) 4
+    <8d>   DW_AT_decl_line   : (data1) 181
+    <8e>   DW_AT_decl_column : (data1) 27
+    <8f>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><93>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <94>   DW_AT_byte_size   : (data1) 8
+    <95>   DW_AT_type        : (ref4) <0x99>, char
+ <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
+    <9a>   DW_AT_byte_size   : (data1) 1
+    <9b>   DW_AT_encoding    : (data1) 6	(signed char)
+    <9c>   DW_AT_name        : (strp) (offset: 0x78c): char
+ <1><a0>: Abbrev Number: 7 (DW_TAG_const_type)
+    <a1>   DW_AT_type        : (ref4) <0x99>, char
+ <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <a6>   DW_AT_name        : (strp) (offset: 0x1647): FILE
+    <aa>   DW_AT_decl_file   : (data1) 5
+    <ab>   DW_AT_decl_line   : (data1) 48
+    <ac>   DW_AT_decl_column : (data1) 25
+    <ad>   DW_AT_type        : (ref4) <0xb1>, _IO_FILE
+ <1><b1>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <b2>   DW_AT_name        : (strp) (offset: 0x1643): _IO_FILE
+    <b6>   DW_AT_byte_size   : (data1) 216
+    <b7>   DW_AT_decl_file   : (data1) 6
+    <b8>   DW_AT_decl_line   : (data1) 246
+    <b9>   DW_AT_decl_column : (data1) 8
+    <ba>   DW_AT_sibling     : (ref4) <0x250>
+ <2><be>: Abbrev Number: 9 (DW_TAG_member)
+    <bf>   DW_AT_name        : (strp) (offset: 0xfab): _flags
+    <c3>   DW_AT_decl_file   : (data1) 6
+    <c4>   DW_AT_decl_line   : (data1) 247
+    <c5>   DW_AT_decl_column : (data1) 7
+    <c6>   DW_AT_type        : (ref4) <0x5f>, int
+    <ca>   DW_AT_data_member_location: (data1) 0
+ <2><cb>: Abbrev Number: 9 (DW_TAG_member)
+    <cc>   DW_AT_name        : (strp) (offset: 0x1af6): _IO_read_ptr
+    <d0>   DW_AT_decl_file   : (data1) 6
+    <d1>   DW_AT_decl_line   : (data1) 252
+    <d2>   DW_AT_decl_column : (data1) 9
+    <d3>   DW_AT_type        : (ref4) <0x93>, char
+    <d7>   DW_AT_data_member_location: (data1) 8
+ <2><d8>: Abbrev Number: 9 (DW_TAG_member)
+    <d9>   DW_AT_name        : (strp) (offset: 0x160e): _IO_read_end
+    <dd>   DW_AT_decl_file   : (data1) 6
+    <de>   DW_AT_decl_line   : (data1) 253
+    <df>   DW_AT_decl_column : (data1) 9
+    <e0>   DW_AT_type        : (ref4) <0x93>, char
+    <e4>   DW_AT_data_member_location: (data1) 16
+ <2><e5>: Abbrev Number: 9 (DW_TAG_member)
+    <e6>   DW_AT_name        : (strp) (offset: 0x11ec): _IO_read_base
+    <ea>   DW_AT_decl_file   : (data1) 6
+    <eb>   DW_AT_decl_line   : (data1) 254
+    <ec>   DW_AT_decl_column : (data1) 9
+    <ed>   DW_AT_type        : (ref4) <0x93>, char
+    <f1>   DW_AT_data_member_location: (data1) 24
+ <2><f2>: Abbrev Number: 9 (DW_TAG_member)
+    <f3>   DW_AT_name        : (strp) (offset: 0x128b): _IO_write_base
+    <f7>   DW_AT_decl_file   : (data1) 6
+    <f8>   DW_AT_decl_line   : (data1) 255
+    <f9>   DW_AT_decl_column : (data1) 9
+    <fa>   DW_AT_type        : (ref4) <0x93>, char
+    <fe>   DW_AT_data_member_location: (data1) 32
+ <2><ff>: Abbrev Number: 10 (DW_TAG_member)
+    <100>   DW_AT_name        : (strp) (offset: 0x9ea): _IO_write_ptr
+    <104>   DW_AT_decl_file   : (data1) 6
+    <105>   DW_AT_decl_line   : (data2) 256
+    <107>   DW_AT_decl_column : (data1) 9
+    <108>   DW_AT_type        : (ref4) <0x93>, char
+    <10c>   DW_AT_data_member_location: (data1) 40
+ <2><10d>: Abbrev Number: 10 (DW_TAG_member)
+    <10e>   DW_AT_name        : (strp) (offset: 0x3f5): _IO_write_end
+    <112>   DW_AT_decl_file   : (data1) 6
+    <113>   DW_AT_decl_line   : (data2) 257
+    <115>   DW_AT_decl_column : (data1) 9
+    <116>   DW_AT_type        : (ref4) <0x93>, char
+    <11a>   DW_AT_data_member_location: (data1) 48
+ <2><11b>: Abbrev Number: 10 (DW_TAG_member)
+    <11c>   DW_AT_name        : (strp) (offset: 0x15ba): _IO_buf_base
+    <120>   DW_AT_decl_file   : (data1) 6
+    <121>   DW_AT_decl_line   : (data2) 258
+    <123>   DW_AT_decl_column : (data1) 9
+    <124>   DW_AT_type        : (ref4) <0x93>, char
+    <128>   DW_AT_data_member_location: (data1) 56
+ <2><129>: Abbrev Number: 10 (DW_TAG_member)
+    <12a>   DW_AT_name        : (strp) (offset: 0x123c): _IO_buf_end
     <12e>   DW_AT_decl_file   : (data1) 6
-    <12f>   DW_AT_decl_line   : (data1) 124
-    <130>   DW_AT_decl_column : (data1) 20
-    <131>   DW_AT_type        : (ref4) <0xe6>, int
-    <135>   DW_AT_external    : (flag_present) 1
-    <135>   DW_AT_declaration : (flag_present) 1
- <1><135>: Abbrev Number: 8 (DW_TAG_variable)
-    <136>   DW_AT_name        : (strp) (offset: 0x1ea2): optopt
-    <13a>   DW_AT_decl_file   : (data1) 6
-    <13b>   DW_AT_decl_line   : (data1) 124
-    <13c>   DW_AT_decl_column : (data1) 28
-    <13d>   DW_AT_type        : (ref4) <0xe6>, int
-    <141>   DW_AT_external    : (flag_present) 1
-    <141>   DW_AT_declaration : (flag_present) 1
- <1><141>: Abbrev Number: 8 (DW_TAG_variable)
-    <142>   DW_AT_name        : (strp) (offset: 0xda1): optreset
-    <146>   DW_AT_decl_file   : (data1) 6
-    <147>   DW_AT_decl_line   : (data1) 179
-    <148>   DW_AT_decl_column : (data1) 12
-    <149>   DW_AT_type        : (ref4) <0xe6>, int
-    <14d>   DW_AT_external    : (flag_present) 1
-    <14d>   DW_AT_declaration : (flag_present) 1
- <1><14d>: Abbrev Number: 8 (DW_TAG_variable)
-    <14e>   DW_AT_name        : (strp) (offset: 0x9c1): environ
-    <152>   DW_AT_decl_file   : (data1) 6
-    <153>   DW_AT_decl_line   : (data1) 183
-    <154>   DW_AT_decl_column : (data1) 15
-    <155>   DW_AT_type        : (ref4) <0x159>, char
-    <159>   DW_AT_external    : (flag_present) 1
-    <159>   DW_AT_declaration : (flag_present) 1
- <1><159>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <15a>   DW_AT_byte_size   : (data1) 8
-    <15b>   DW_AT_type        : (ref4) <0xda>, char
- <1><15f>: Abbrev Number: 2 (DW_TAG_base_type)
-    <160>   DW_AT_byte_size   : (data1) 1
-    <161>   DW_AT_encoding    : (data1) 6	(signed char)
-    <162>   DW_AT_name        : (strp) (offset: 0x9cb): signed char
- <1><166>: Abbrev Number: 2 (DW_TAG_base_type)
-    <167>   DW_AT_byte_size   : (data1) 2
-    <168>   DW_AT_encoding    : (data1) 5	(signed)
-    <169>   DW_AT_name        : (strp) (offset: 0x2468): short int
- <1><16d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <16e>   DW_AT_name        : (strp) (offset: 0x24c1): int64_t
-    <172>   DW_AT_decl_file   : (data1) 3
-    <173>   DW_AT_decl_line   : (data1) 152
-    <174>   DW_AT_decl_column : (data1) 25
-    <175>   DW_AT_type        : (ref4) <0x78>, long int
- <1><179>: Abbrev Number: 2 (DW_TAG_base_type)
-    <17a>   DW_AT_byte_size   : (data1) 1
-    <17b>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <17c>   DW_AT_name        : (strp) (offset: 0x9c9): unsigned char
- <1><180>: Abbrev Number: 3 (DW_TAG_const_type)
-    <181>   DW_AT_type        : (ref4) <0x179>, unsigned char
- <1><185>: Abbrev Number: 2 (DW_TAG_base_type)
-    <186>   DW_AT_byte_size   : (data1) 2
-    <187>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <188>   DW_AT_name        : (strp) (offset: 0x29da): short unsigned int
- <1><18c>: Abbrev Number: 5 (DW_TAG_typedef)
-    <18d>   DW_AT_name        : (strp) (offset: 0x28b0): uint32_t
-    <191>   DW_AT_decl_file   : (data1) 3
-    <192>   DW_AT_decl_line   : (data1) 172
-    <193>   DW_AT_decl_column : (data1) 25
-    <194>   DW_AT_type        : (ref4) <0x52>, unsigned int
- <1><198>: Abbrev Number: 5 (DW_TAG_typedef)
-    <199>   DW_AT_name        : (strp) (offset: 0x24c0): uint64_t
-    <19d>   DW_AT_decl_file   : (data1) 3
-    <19e>   DW_AT_decl_line   : (data1) 177
-    <19f>   DW_AT_decl_column : (data1) 25
-    <1a0>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
- <1><1a4>: Abbrev Number: 5 (DW_TAG_typedef)
-    <1a5>   DW_AT_name        : (strp) (offset: 0x1f30): Py_ssize_t
-    <1a9>   DW_AT_decl_file   : (data1) 7
-    <1aa>   DW_AT_decl_line   : (data1) 105
-    <1ab>   DW_AT_decl_column : (data1) 25
-    <1ac>   DW_AT_type        : (ref4) <0x6c>, ssize_t, long int
- <1><1b0>: Abbrev Number: 3 (DW_TAG_const_type)
-    <1b1>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <1><1b5>: Abbrev Number: 5 (DW_TAG_typedef)
-    <1b6>   DW_AT_name        : (strp) (offset: 0x654): Py_hash_t
-    <1ba>   DW_AT_decl_file   : (data1) 7
-    <1bb>   DW_AT_decl_line   : (data1) 114
-    <1bc>   DW_AT_decl_column : (data1) 20
-    <1bd>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <1><1c1>: Abbrev Number: 2 (DW_TAG_base_type)
-    <1c2>   DW_AT_byte_size   : (data1) 4
-    <1c3>   DW_AT_encoding    : (data1) 4	(float)
-    <1c4>   DW_AT_name        : (strp) (offset: 0xac2): float
- <1><1c8>: Abbrev Number: 11 (DW_TAG_variable)
-    <1c9>   DW_AT_name        : (strp) (offset: 0x1f14): signgam
-    <1cd>   DW_AT_decl_file   : (data1) 8
-    <1ce>   DW_AT_decl_line   : (data2) 384
-    <1d0>   DW_AT_decl_column : (data1) 12
-    <1d1>   DW_AT_type        : (ref4) <0xe6>, int
-    <1d5>   DW_AT_external    : (flag_present) 1
-    <1d5>   DW_AT_declaration : (flag_present) 1
- <1><1d5>: Abbrev Number: 12 (DW_TAG_array_type)
-    <1d6>   DW_AT_type        : (ref4) <0xda>, char
-    <1da>   DW_AT_sibling     : (ref4) <0x1e5>
- <2><1de>: Abbrev Number: 13 (DW_TAG_subrange_type)
-    <1df>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
-    <1e3>   DW_AT_upper_bound : (data1) 1
- <2><1e4>: Abbrev Number: 0
- <1><1e5>: Abbrev Number: 8 (DW_TAG_variable)
-    <1e6>   DW_AT_name        : (strp) (offset: 0x19ff): tzname
-    <1ea>   DW_AT_decl_file   : (data1) 9
-    <1eb>   DW_AT_decl_line   : (data1) 114
-    <1ec>   DW_AT_decl_column : (data1) 14
-    <1ed>   DW_AT_type        : (ref4) <0x1d5>, char
-    <1f1>   DW_AT_external    : (flag_present) 1
-    <1f1>   DW_AT_declaration : (flag_present) 1
- <1><1f1>: Abbrev Number: 8 (DW_TAG_variable)
-    <1f2>   DW_AT_name        : (strp) (offset: 0x2b23): daylight
-    <1f6>   DW_AT_decl_file   : (data1) 9
-    <1f7>   DW_AT_decl_line   : (data1) 121
-    <1f8>   DW_AT_decl_column : (data1) 12
-    <1f9>   DW_AT_type        : (ref4) <0xe6>, int
-    <1fd>   DW_AT_external    : (flag_present) 1
-    <1fd>   DW_AT_declaration : (flag_present) 1
- <1><1fd>: Abbrev Number: 8 (DW_TAG_variable)
-    <1fe>   DW_AT_name        : (strp) (offset: 0xce3): timezone
-    <202>   DW_AT_decl_file   : (data1) 9
-    <203>   DW_AT_decl_line   : (data1) 122
-    <204>   DW_AT_decl_column : (data1) 13
-    <205>   DW_AT_type        : (ref4) <0x78>, long int
-    <209>   DW_AT_external    : (flag_present) 1
-    <209>   DW_AT_declaration : (flag_present) 1
- <1><209>: Abbrev Number: 8 (DW_TAG_variable)
-    <20a>   DW_AT_name        : (strp) (offset: 0x288d): getdate_err
-    <20e>   DW_AT_decl_file   : (data1) 9
-    <20f>   DW_AT_decl_line   : (data1) 123
-    <210>   DW_AT_decl_column : (data1) 12
-    <211>   DW_AT_type        : (ref4) <0xe6>, int
-    <215>   DW_AT_external    : (flag_present) 1
-    <215>   DW_AT_declaration : (flag_present) 1
- <1><215>: Abbrev Number: 14 (DW_TAG_enumeration_type)
-    <216>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <217>   DW_AT_byte_size   : (data1) 4
-    <218>   DW_AT_type        : (ref4) <0x52>, unsigned int
-    <21c>   DW_AT_decl_file   : (data1) 10
-    <21d>   DW_AT_decl_line   : (data1) 112
-    <21e>   DW_AT_decl_column : (data1) 10
-    <21f>   DW_AT_sibling     : (ref4) <0x236>
- <2><223>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <224>   DW_AT_name        : (strp) (offset: 0x1dd1): TRACEMALLOC_NOT_INITIALIZED
-    <228>   DW_AT_const_value : (data1) 0
- <2><229>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <22a>   DW_AT_name        : (strp) (offset: 0x2ab): TRACEMALLOC_INITIALIZED
-    <22e>   DW_AT_const_value : (data1) 1
- <2><22f>: Abbrev Number: 15 (DW_TAG_enumerator)
-    <230>   DW_AT_name        : (strp) (offset: 0x17fc): TRACEMALLOC_FINALIZED
-    <234>   DW_AT_const_value : (data1) 2
- <2><235>: Abbrev Number: 0
- <1><236>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <237>   DW_AT_name        : (strp) (offset: 0x2527): _PyTraceMalloc_Config
-    <23b>   DW_AT_byte_size   : (data1) 16
-    <23c>   DW_AT_decl_file   : (data1) 10
-    <23d>   DW_AT_decl_line   : (data1) 109
-    <23e>   DW_AT_decl_column : (data1) 8
-    <23f>   DW_AT_sibling     : (ref4) <0x278>
- <2><243>: Abbrev Number: 17 (DW_TAG_member)
-    <244>   DW_AT_name        : (strp) (offset: 0x1557): initialized
-    <248>   DW_AT_decl_file   : (data1) 10
-    <249>   DW_AT_decl_line   : (data1) 116
-    <24a>   DW_AT_decl_column : (data1) 7
-    <24b>   DW_AT_type        : (ref4) <0x215>, unsigned int
-    <24f>   DW_AT_data_member_location: (data1) 0
- <2><250>: Abbrev Number: 17 (DW_TAG_member)
-    <251>   DW_AT_name        : (strp) (offset: 0x1a3a): tracing
-    <255>   DW_AT_decl_file   : (data1) 10
-    <256>   DW_AT_decl_line   : (data1) 120
-    <257>   DW_AT_decl_column : (data1) 9
-    <258>   DW_AT_type        : (ref4) <0xe6>, int
-    <25c>   DW_AT_data_member_location: (data1) 4
- <2><25d>: Abbrev Number: 17 (DW_TAG_member)
-    <25e>   DW_AT_name        : (strp) (offset: 0x12e3): max_nframe
-    <262>   DW_AT_decl_file   : (data1) 10
-    <263>   DW_AT_decl_line   : (data1) 124
-    <264>   DW_AT_decl_column : (data1) 9
-    <265>   DW_AT_type        : (ref4) <0xe6>, int
-    <269>   DW_AT_data_member_location: (data1) 8
- <2><26a>: Abbrev Number: 17 (DW_TAG_member)
-    <26b>   DW_AT_name        : (strp) (offset: 0x1fea): use_domain
-    <26f>   DW_AT_decl_file   : (data1) 10
-    <270>   DW_AT_decl_line   : (data1) 128
-    <271>   DW_AT_decl_column : (data1) 9
-    <272>   DW_AT_type        : (ref4) <0xe6>, int
-    <276>   DW_AT_data_member_location: (data1) 12
- <2><277>: Abbrev Number: 0
- <1><278>: Abbrev Number: 8 (DW_TAG_variable)
-    <279>   DW_AT_name        : (strp) (offset: 0x220b): _Py_tracemalloc_config
-    <27d>   DW_AT_decl_file   : (data1) 10
-    <27e>   DW_AT_decl_line   : (data1) 131
-    <27f>   DW_AT_decl_column : (data1) 42
-    <280>   DW_AT_type        : (ref4) <0x236>, _PyTraceMalloc_Config
-    <284>   DW_AT_external    : (flag_present) 1
-    <284>   DW_AT_declaration : (flag_present) 1
- <1><284>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <285>   DW_AT_name        : (strp) (offset: 0x2c4e): _object
-    <289>   DW_AT_byte_size   : (data1) 16
-    <28a>   DW_AT_decl_file   : (data1) 2
-    <28b>   DW_AT_decl_line   : (data1) 104
-    <28c>   DW_AT_decl_column : (data1) 16
-    <28d>   DW_AT_sibling     : (ref4) <0x2ac>
- <2><291>: Abbrev Number: 17 (DW_TAG_member)
-    <292>   DW_AT_name        : (strp) (offset: 0x64a): ob_refcnt
-    <296>   DW_AT_decl_file   : (data1) 2
-    <297>   DW_AT_decl_line   : (data1) 106
-    <298>   DW_AT_decl_column : (data1) 16
-    <299>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <29d>   DW_AT_data_member_location: (data1) 0
- <2><29e>: Abbrev Number: 17 (DW_TAG_member)
-    <29f>   DW_AT_name        : (strp) (offset: 0x2991): ob_type
-    <2a3>   DW_AT_decl_file   : (data1) 2
-    <2a4>   DW_AT_decl_line   : (data1) 107
-    <2a5>   DW_AT_decl_column : (data1) 25
-    <2a6>   DW_AT_type        : (ref4) <0x55c>, _typeobject
-    <2aa>   DW_AT_data_member_location: (data1) 8
- <2><2ab>: Abbrev Number: 0
- <1><2ac>: Abbrev Number: 18 (DW_TAG_structure_type)
-    <2ad>   DW_AT_name        : (strp) (offset: 0x149a): _typeobject
-    <2b1>   DW_AT_byte_size   : (data2) 416
-    <2b3>   DW_AT_decl_file   : (data1) 11
-    <2b4>   DW_AT_decl_line   : (data1) 177
-    <2b5>   DW_AT_decl_column : (data1) 16
-    <2b6>   DW_AT_sibling     : (ref4) <0x55c>
- <2><2ba>: Abbrev Number: 17 (DW_TAG_member)
-    <2bb>   DW_AT_name        : (strp) (offset: 0x41c): ob_base
-    <2bf>   DW_AT_decl_file   : (data1) 11
-    <2c0>   DW_AT_decl_line   : (data1) 178
-    <2c1>   DW_AT_decl_column : (data1) 5
-    <2c2>   DW_AT_type        : (ref4) <0x592>, PyVarObject
-    <2c6>   DW_AT_data_member_location: (data1) 0
- <2><2c7>: Abbrev Number: 17 (DW_TAG_member)
-    <2c8>   DW_AT_name        : (strp) (offset: 0x55d): tp_name
-    <2cc>   DW_AT_decl_file   : (data1) 11
-    <2cd>   DW_AT_decl_line   : (data1) 179
-    <2ce>   DW_AT_decl_column : (data1) 17
-    <2cf>   DW_AT_type        : (ref4) <0xe0>, char
-    <2d3>   DW_AT_data_member_location: (data1) 24
- <2><2d4>: Abbrev Number: 17 (DW_TAG_member)
-    <2d5>   DW_AT_name        : (strp) (offset: 0x2398): tp_basicsize
-    <2d9>   DW_AT_decl_file   : (data1) 11
-    <2da>   DW_AT_decl_line   : (data1) 180
-    <2db>   DW_AT_decl_column : (data1) 16
-    <2dc>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <2e0>   DW_AT_data_member_location: (data1) 32
- <2><2e1>: Abbrev Number: 17 (DW_TAG_member)
-    <2e2>   DW_AT_name        : (strp) (offset: 0x24d1): tp_itemsize
-    <2e6>   DW_AT_decl_file   : (data1) 11
-    <2e7>   DW_AT_decl_line   : (data1) 180
-    <2e8>   DW_AT_decl_column : (data1) 30
-    <2e9>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <2ed>   DW_AT_data_member_location: (data1) 40
- <2><2ee>: Abbrev Number: 17 (DW_TAG_member)
-    <2ef>   DW_AT_name        : (strp) (offset: 0x1c1): tp_dealloc
-    <2f3>   DW_AT_decl_file   : (data1) 11
-    <2f4>   DW_AT_decl_line   : (data1) 184
-    <2f5>   DW_AT_decl_column : (data1) 16
-    <2f6>   DW_AT_type        : (ref4) <0x76d>, destructor
-    <2fa>   DW_AT_data_member_location: (data1) 48
- <2><2fb>: Abbrev Number: 17 (DW_TAG_member)
-    <2fc>   DW_AT_name        : (strp) (offset: 0xb62): tp_vectorcall_offset
-    <300>   DW_AT_decl_file   : (data1) 11
-    <301>   DW_AT_decl_line   : (data1) 185
-    <302>   DW_AT_decl_column : (data1) 16
-    <303>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <307>   DW_AT_data_member_location: (data1) 56
- <2><308>: Abbrev Number: 17 (DW_TAG_member)
-    <309>   DW_AT_name        : (strp) (offset: 0x2332): tp_getattr
-    <30d>   DW_AT_decl_file   : (data1) 11
-    <30e>   DW_AT_decl_line   : (data1) 186
-    <30f>   DW_AT_decl_column : (data1) 17
-    <310>   DW_AT_type        : (ref4) <0x78a>, getattrfunc, PyObject, _object
-    <314>   DW_AT_data_member_location: (data1) 64
- <2><315>: Abbrev Number: 17 (DW_TAG_member)
-    <316>   DW_AT_name        : (strp) (offset: 0x11ae): tp_setattr
-    <31a>   DW_AT_decl_file   : (data1) 11
-    <31b>   DW_AT_decl_line   : (data1) 187
-    <31c>   DW_AT_decl_column : (data1) 17
-    <31d>   DW_AT_type        : (ref4) <0x7bc>, setattrfunc, int
-    <321>   DW_AT_data_member_location: (data1) 72
- <2><322>: Abbrev Number: 17 (DW_TAG_member)
-    <323>   DW_AT_name        : (strp) (offset: 0x1f5f): tp_as_async
-    <327>   DW_AT_decl_file   : (data1) 11
-    <328>   DW_AT_decl_line   : (data1) 188
-    <329>   DW_AT_decl_column : (data1) 21
-    <32a>   DW_AT_type        : (ref4) <0xd7f>, PyAsyncMethods
-    <32e>   DW_AT_data_member_location: (data1) 80
- <2><32f>: Abbrev Number: 17 (DW_TAG_member)
-    <330>   DW_AT_name        : (strp) (offset: 0x263): tp_repr
-    <334>   DW_AT_decl_file   : (data1) 11
-    <335>   DW_AT_decl_line   : (data1) 190
-    <336>   DW_AT_decl_column : (data1) 14
-    <337>   DW_AT_type        : (ref4) <0x7f3>, reprfunc, PyObject, _object
-    <33b>   DW_AT_data_member_location: (data1) 88
- <2><33c>: Abbrev Number: 17 (DW_TAG_member)
-    <33d>   DW_AT_name        : (strp) (offset: 0x2604): tp_as_number
-    <341>   DW_AT_decl_file   : (data1) 11
-    <342>   DW_AT_decl_line   : (data1) 194
-    <343>   DW_AT_decl_column : (data1) 22
-    <344>   DW_AT_type        : (ref4) <0xd85>, PyNumberMethods
-    <348>   DW_AT_data_member_location: (data1) 96
- <2><349>: Abbrev Number: 17 (DW_TAG_member)
-    <34a>   DW_AT_name        : (strp) (offset: 0x254): tp_as_sequence
-    <34e>   DW_AT_decl_file   : (data1) 11
-    <34f>   DW_AT_decl_line   : (data1) 195
-    <350>   DW_AT_decl_column : (data1) 24
-    <351>   DW_AT_type        : (ref4) <0xd8b>, PySequenceMethods
-    <355>   DW_AT_data_member_location: (data1) 104
- <2><356>: Abbrev Number: 17 (DW_TAG_member)
-    <357>   DW_AT_name        : (strp) (offset: 0x1178): tp_as_mapping
-    <35b>   DW_AT_decl_file   : (data1) 11
-    <35c>   DW_AT_decl_line   : (data1) 196
-    <35d>   DW_AT_decl_column : (data1) 23
-    <35e>   DW_AT_type        : (ref4) <0xd91>, PyMappingMethods
-    <362>   DW_AT_data_member_location: (data1) 112
- <2><363>: Abbrev Number: 17 (DW_TAG_member)
-    <364>   DW_AT_name        : (strp) (offset: 0xcc2): tp_hash
-    <368>   DW_AT_decl_file   : (data1) 11
-    <369>   DW_AT_decl_line   : (data1) 200
-    <36a>   DW_AT_decl_column : (data1) 14
-    <36b>   DW_AT_type        : (ref4) <0x7ff>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
-    <36f>   DW_AT_data_member_location: (data1) 120
- <2><370>: Abbrev Number: 17 (DW_TAG_member)
-    <371>   DW_AT_name        : (strp) (offset: 0x18aa): tp_call
-    <375>   DW_AT_decl_file   : (data1) 11
-    <376>   DW_AT_decl_line   : (data1) 201
-    <377>   DW_AT_decl_column : (data1) 17
-    <378>   DW_AT_type        : (ref4) <0x5f0>, ternaryfunc, PyObject, _object
-    <37c>   DW_AT_data_member_location: (data1) 128
- <2><37d>: Abbrev Number: 17 (DW_TAG_member)
-    <37e>   DW_AT_name        : (strp) (offset: 0x12ca): tp_str
-    <382>   DW_AT_decl_file   : (data1) 11
-    <383>   DW_AT_decl_line   : (data1) 202
-    <384>   DW_AT_decl_column : (data1) 14
-    <385>   DW_AT_type        : (ref4) <0x7f3>, reprfunc, PyObject, _object
-    <389>   DW_AT_data_member_location: (data1) 136
- <2><38a>: Abbrev Number: 17 (DW_TAG_member)
-    <38b>   DW_AT_name        : (strp) (offset: 0xe47): tp_getattro
-    <38f>   DW_AT_decl_file   : (data1) 11
-    <390>   DW_AT_decl_line   : (data1) 203
-    <391>   DW_AT_decl_column : (data1) 18
-    <392>   DW_AT_type        : (ref4) <0x7b0>, getattrofunc, PyObject, _object
-    <396>   DW_AT_data_member_location: (data1) 144
- <2><397>: Abbrev Number: 17 (DW_TAG_member)
-    <398>   DW_AT_name        : (strp) (offset: 0x1bd2): tp_setattro
-    <39c>   DW_AT_decl_file   : (data1) 11
-    <39d>   DW_AT_decl_line   : (data1) 204
-    <39e>   DW_AT_decl_column : (data1) 18
-    <39f>   DW_AT_type        : (ref4) <0x7e7>, setattrofunc, int
-    <3a3>   DW_AT_data_member_location: (data1) 152
- <2><3a4>: Abbrev Number: 17 (DW_TAG_member)
-    <3a5>   DW_AT_name        : (strp) (offset: 0x2175): tp_as_buffer
-    <3a9>   DW_AT_decl_file   : (data1) 11
-    <3aa>   DW_AT_decl_line   : (data1) 207
-    <3ab>   DW_AT_decl_column : (data1) 20
-    <3ac>   DW_AT_type        : (ref4) <0xd97>, PyBufferProcs
-    <3b0>   DW_AT_data_member_location: (data1) 160
- <2><3b1>: Abbrev Number: 17 (DW_TAG_member)
-    <3b2>   DW_AT_name        : (strp) (offset: 0x1523): tp_flags
-    <3b6>   DW_AT_decl_file   : (data1) 11
-    <3b7>   DW_AT_decl_line   : (data1) 210
-    <3b8>   DW_AT_decl_column : (data1) 19
-    <3b9>   DW_AT_type        : (ref4) <0x4b>, long unsigned int
-    <3bd>   DW_AT_data_member_location: (data1) 168
- <2><3be>: Abbrev Number: 17 (DW_TAG_member)
-    <3bf>   DW_AT_name        : (strp) (offset: 0x988): tp_doc
-    <3c3>   DW_AT_decl_file   : (data1) 11
-    <3c4>   DW_AT_decl_line   : (data1) 212
-    <3c5>   DW_AT_decl_column : (data1) 17
-    <3c6>   DW_AT_type        : (ref4) <0xe0>, char
-    <3ca>   DW_AT_data_member_location: (data1) 176
- <2><3cb>: Abbrev Number: 17 (DW_TAG_member)
-    <3cc>   DW_AT_name        : (strp) (offset: 0x10c2): tp_traverse
-    <3d0>   DW_AT_decl_file   : (data1) 11
-    <3d1>   DW_AT_decl_line   : (data1) 216
-    <3d2>   DW_AT_decl_column : (data1) 18
-    <3d3>   DW_AT_type        : (ref4) <0x725>, traverseproc, int
-    <3d7>   DW_AT_data_member_location: (data1) 184
- <2><3d8>: Abbrev Number: 17 (DW_TAG_member)
-    <3d9>   DW_AT_name        : (strp) (offset: 0x1893): tp_clear
-    <3dd>   DW_AT_decl_file   : (data1) 11
-    <3de>   DW_AT_decl_line   : (data1) 219
-    <3df>   DW_AT_decl_column : (data1) 13
-    <3e0>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
-    <3e4>   DW_AT_data_member_location: (data1) 192
- <2><3e5>: Abbrev Number: 17 (DW_TAG_member)
-    <3e6>   DW_AT_name        : (strp) (offset: 0x187): tp_richcompare
-    <3ea>   DW_AT_decl_file   : (data1) 11
-    <3eb>   DW_AT_decl_line   : (data1) 223
-    <3ec>   DW_AT_decl_column : (data1) 17
-    <3ed>   DW_AT_type        : (ref4) <0x820>, richcmpfunc, PyObject, _object
-    <3f1>   DW_AT_data_member_location: (data1) 200
- <2><3f2>: Abbrev Number: 17 (DW_TAG_member)
-    <3f3>   DW_AT_name        : (strp) (offset: 0x523): tp_weaklistoffset
-    <3f7>   DW_AT_decl_file   : (data1) 11
-    <3f8>   DW_AT_decl_line   : (data1) 226
-    <3f9>   DW_AT_decl_column : (data1) 16
-    <3fa>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <3fe>   DW_AT_data_member_location: (data1) 208
- <2><3ff>: Abbrev Number: 17 (DW_TAG_member)
-    <400>   DW_AT_name        : (strp) (offset: 0x797): tp_iter
-    <404>   DW_AT_decl_file   : (data1) 11
-    <405>   DW_AT_decl_line   : (data1) 229
-    <406>   DW_AT_decl_column : (data1) 17
-    <407>   DW_AT_type        : (ref4) <0x84b>, getiterfunc, PyObject, _object
-    <40b>   DW_AT_data_member_location: (data1) 216
- <2><40c>: Abbrev Number: 17 (DW_TAG_member)
-    <40d>   DW_AT_name        : (strp) (offset: 0x1887): tp_iternext
-    <411>   DW_AT_decl_file   : (data1) 11
-    <412>   DW_AT_decl_line   : (data1) 230
-    <413>   DW_AT_decl_column : (data1) 18
-    <414>   DW_AT_type        : (ref4) <0x857>, iternextfunc, PyObject, _object
-    <418>   DW_AT_data_member_location: (data1) 224
- <2><419>: Abbrev Number: 17 (DW_TAG_member)
-    <41a>   DW_AT_name        : (strp) (offset: 0x401): tp_methods
-    <41e>   DW_AT_decl_file   : (data1) 11
-    <41f>   DW_AT_decl_line   : (data1) 233
-    <420>   DW_AT_decl_column : (data1) 25
-    <421>   DW_AT_type        : (ref4) <0xddf>, PyMethodDef
-    <425>   DW_AT_data_member_location: (data1) 232
- <2><426>: Abbrev Number: 17 (DW_TAG_member)
-    <427>   DW_AT_name        : (strp) (offset: 0x1a7a): tp_members
-    <42b>   DW_AT_decl_file   : (data1) 11
-    <42c>   DW_AT_decl_line   : (data1) 234
-    <42d>   DW_AT_decl_column : (data1) 25
-    <42e>   DW_AT_type        : (ref4) <0xdea>, PyMemberDef
-    <432>   DW_AT_data_member_location: (data1) 240
- <2><433>: Abbrev Number: 17 (DW_TAG_member)
-    <434>   DW_AT_name        : (strp) (offset: 0x20c9): tp_getset
-    <438>   DW_AT_decl_file   : (data1) 11
-    <439>   DW_AT_decl_line   : (data1) 235
-    <43a>   DW_AT_decl_column : (data1) 25
-    <43b>   DW_AT_type        : (ref4) <0xe3f>, PyGetSetDef
-    <43f>   DW_AT_data_member_location: (data1) 248
- <2><440>: Abbrev Number: 19 (DW_TAG_member)
-    <441>   DW_AT_name        : (strp) (offset: 0xb32): tp_base
-    <445>   DW_AT_decl_file   : (data1) 11
-    <446>   DW_AT_decl_line   : (data1) 236
-    <447>   DW_AT_decl_column : (data1) 25
-    <448>   DW_AT_type        : (ref4) <0x55c>, _typeobject
-    <44c>   DW_AT_data_member_location: (data2) 256
- <2><44e>: Abbrev Number: 19 (DW_TAG_member)
-    <44f>   DW_AT_name        : (strp) (offset: 0x101e): tp_dict
-    <453>   DW_AT_decl_file   : (data1) 11
-    <454>   DW_AT_decl_line   : (data1) 237
-    <455>   DW_AT_decl_column : (data1) 15
-    <456>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <45a>   DW_AT_data_member_location: (data2) 264
- <2><45c>: Abbrev Number: 19 (DW_TAG_member)
-    <45d>   DW_AT_name        : (strp) (offset: 0x2a0a): tp_descr_get
-    <461>   DW_AT_decl_file   : (data1) 11
-    <462>   DW_AT_decl_line   : (data1) 238
-    <463>   DW_AT_decl_column : (data1) 18
-    <464>   DW_AT_type        : (ref4) <0x863>, descrgetfunc, PyObject, _object
-    <468>   DW_AT_data_member_location: (data2) 272
- <2><46a>: Abbrev Number: 19 (DW_TAG_member)
-    <46b>   DW_AT_name        : (strp) (offset: 0xf7f): tp_descr_set
-    <46f>   DW_AT_decl_file   : (data1) 11
-    <470>   DW_AT_decl_line   : (data1) 239
-    <471>   DW_AT_decl_column : (data1) 18
-    <472>   DW_AT_type        : (ref4) <0x86f>, descrsetfunc, int
-    <476>   DW_AT_data_member_location: (data2) 280
- <2><478>: Abbrev Number: 19 (DW_TAG_member)
-    <479>   DW_AT_name        : (strp) (offset: 0x2cd9): tp_dictoffset
-    <47d>   DW_AT_decl_file   : (data1) 11
-    <47e>   DW_AT_decl_line   : (data1) 240
-    <47f>   DW_AT_decl_column : (data1) 16
-    <480>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <484>   DW_AT_data_member_location: (data2) 288
- <2><486>: Abbrev Number: 19 (DW_TAG_member)
-    <487>   DW_AT_name        : (strp) (offset: 0x424): tp_init
-    <48b>   DW_AT_decl_file   : (data1) 11
-    <48c>   DW_AT_decl_line   : (data1) 241
-    <48d>   DW_AT_decl_column : (data1) 14
-    <48e>   DW_AT_type        : (ref4) <0x87b>, initproc, int
-    <492>   DW_AT_data_member_location: (data2) 296
- <2><494>: Abbrev Number: 19 (DW_TAG_member)
-    <495>   DW_AT_name        : (strp) (offset: 0x1f92): tp_alloc
-    <499>   DW_AT_decl_file   : (data1) 11
-    <49a>   DW_AT_decl_line   : (data1) 242
-    <49b>   DW_AT_decl_column : (data1) 15
-    <49c>   DW_AT_type        : (ref4) <0x8b2>, allocfunc, PyObject, _object
-    <4a0>   DW_AT_data_member_location: (data2) 304
- <2><4a2>: Abbrev Number: 19 (DW_TAG_member)
-    <4a3>   DW_AT_name        : (strp) (offset: 0x2939): tp_new
-    <4a7>   DW_AT_decl_file   : (data1) 11
-    <4a8>   DW_AT_decl_line   : (data1) 243
-    <4a9>   DW_AT_decl_column : (data1) 13
-    <4aa>   DW_AT_type        : (ref4) <0x887>, newfunc, PyObject, _object
-    <4ae>   DW_AT_data_member_location: (data2) 312
- <2><4b0>: Abbrev Number: 19 (DW_TAG_member)
-    <4b1>   DW_AT_name        : (strp) (offset: 0xac8): tp_free
-    <4b5>   DW_AT_decl_file   : (data1) 11
-    <4b6>   DW_AT_decl_line   : (data1) 244
-    <4b7>   DW_AT_decl_column : (data1) 14
-    <4b8>   DW_AT_type        : (ref4) <0x750>, freefunc
-    <4bc>   DW_AT_data_member_location: (data2) 320
- <2><4be>: Abbrev Number: 19 (DW_TAG_member)
-    <4bf>   DW_AT_name        : (strp) (offset: 0x535): tp_is_gc
-    <4c3>   DW_AT_decl_file   : (data1) 11
-    <4c4>   DW_AT_decl_line   : (data1) 245
-    <4c5>   DW_AT_decl_column : (data1) 13
-    <4c6>   DW_AT_type        : (ref4) <0x61b>, inquiry, int
-    <4ca>   DW_AT_data_member_location: (data2) 328
- <2><4cc>: Abbrev Number: 19 (DW_TAG_member)
-    <4cd>   DW_AT_name        : (strp) (offset: 0x3c8): tp_bases
-    <4d1>   DW_AT_decl_file   : (data1) 11
-    <4d2>   DW_AT_decl_line   : (data1) 246
-    <4d3>   DW_AT_decl_column : (data1) 15
-    <4d4>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <4d8>   DW_AT_data_member_location: (data2) 336
- <2><4da>: Abbrev Number: 19 (DW_TAG_member)
-    <4db>   DW_AT_name        : (strp) (offset: 0x5fe): tp_mro
+    <12f>   DW_AT_decl_line   : (data2) 259
+    <131>   DW_AT_decl_column : (data1) 9
+    <132>   DW_AT_type        : (ref4) <0x93>, char
+    <136>   DW_AT_data_member_location: (data1) 64
+ <2><137>: Abbrev Number: 10 (DW_TAG_member)
+    <138>   DW_AT_name        : (strp) (offset: 0xc33): _IO_save_base
+    <13c>   DW_AT_decl_file   : (data1) 6
+    <13d>   DW_AT_decl_line   : (data2) 261
+    <13f>   DW_AT_decl_column : (data1) 9
+    <140>   DW_AT_type        : (ref4) <0x93>, char
+    <144>   DW_AT_data_member_location: (data1) 72
+ <2><145>: Abbrev Number: 10 (DW_TAG_member)
+    <146>   DW_AT_name        : (strp) (offset: 0x1ae6): _IO_backup_base
+    <14a>   DW_AT_decl_file   : (data1) 6
+    <14b>   DW_AT_decl_line   : (data2) 262
+    <14d>   DW_AT_decl_column : (data1) 9
+    <14e>   DW_AT_type        : (ref4) <0x93>, char
+    <152>   DW_AT_data_member_location: (data1) 80
+ <2><153>: Abbrev Number: 10 (DW_TAG_member)
+    <154>   DW_AT_name        : (strp) (offset: 0x1071): _IO_save_end
+    <158>   DW_AT_decl_file   : (data1) 6
+    <159>   DW_AT_decl_line   : (data2) 263
+    <15b>   DW_AT_decl_column : (data1) 9
+    <15c>   DW_AT_type        : (ref4) <0x93>, char
+    <160>   DW_AT_data_member_location: (data1) 88
+ <2><161>: Abbrev Number: 10 (DW_TAG_member)
+    <162>   DW_AT_name        : (strp) (offset: 0x1771): _markers
+    <166>   DW_AT_decl_file   : (data1) 6
+    <167>   DW_AT_decl_line   : (data2) 265
+    <169>   DW_AT_decl_column : (data1) 22
+    <16a>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
+    <16e>   DW_AT_data_member_location: (data1) 96
+ <2><16f>: Abbrev Number: 10 (DW_TAG_member)
+    <170>   DW_AT_name        : (strp) (offset: 0x70d): _chain
+    <174>   DW_AT_decl_file   : (data1) 6
+    <175>   DW_AT_decl_line   : (data2) 267
+    <177>   DW_AT_decl_column : (data1) 20
+    <178>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
+    <17c>   DW_AT_data_member_location: (data1) 104
+ <2><17d>: Abbrev Number: 10 (DW_TAG_member)
+    <17e>   DW_AT_name        : (strp) (offset: 0x41): _fileno
+    <182>   DW_AT_decl_file   : (data1) 6
+    <183>   DW_AT_decl_line   : (data2) 269
+    <185>   DW_AT_decl_column : (data1) 7
+    <186>   DW_AT_type        : (ref4) <0x5f>, int
+    <18a>   DW_AT_data_member_location: (data1) 112
+ <2><18b>: Abbrev Number: 10 (DW_TAG_member)
+    <18c>   DW_AT_name        : (strp) (offset: 0x1ca2): _flags2
+    <190>   DW_AT_decl_file   : (data1) 6
+    <191>   DW_AT_decl_line   : (data2) 273
+    <193>   DW_AT_decl_column : (data1) 7
+    <194>   DW_AT_type        : (ref4) <0x5f>, int
+    <198>   DW_AT_data_member_location: (data1) 116
+ <2><199>: Abbrev Number: 10 (DW_TAG_member)
+    <19a>   DW_AT_name        : (strp) (offset: 0x1c26): _old_offset
+    <19e>   DW_AT_decl_file   : (data1) 6
+    <19f>   DW_AT_decl_line   : (data2) 275
+    <1a1>   DW_AT_decl_column : (data1) 13
+    <1a2>   DW_AT_type        : (ref4) <0x6d>, __off_t, long int
+    <1a6>   DW_AT_data_member_location: (data1) 120
+ <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
+    <1a8>   DW_AT_name        : (strp) (offset: 0x1a4c): _cur_column
+    <1ac>   DW_AT_decl_file   : (data1) 6
+    <1ad>   DW_AT_decl_line   : (data2) 279
+    <1af>   DW_AT_decl_column : (data1) 18
+    <1b0>   DW_AT_type        : (ref4) <0x43>, short unsigned int
+    <1b4>   DW_AT_data_member_location: (data1) 128
+ <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
+    <1b6>   DW_AT_name        : (strp) (offset: 0x1e65): _vtable_offset
+    <1ba>   DW_AT_decl_file   : (data1) 6
+    <1bb>   DW_AT_decl_line   : (data2) 280
+    <1bd>   DW_AT_decl_column : (data1) 15
+    <1be>   DW_AT_type        : (ref4) <0x51>, signed char
+    <1c2>   DW_AT_data_member_location: (data1) 130
+ <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
+    <1c4>   DW_AT_name        : (strp) (offset: 0x19b): _shortbuf
+    <1c8>   DW_AT_decl_file   : (data1) 6
+    <1c9>   DW_AT_decl_line   : (data2) 281
+    <1cb>   DW_AT_decl_column : (data1) 8
+    <1cc>   DW_AT_type        : (ref4) <0x299>, char
+    <1d0>   DW_AT_data_member_location: (data1) 131
+ <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
+    <1d2>   DW_AT_name        : (strp) (offset: 0x299): _lock
+    <1d6>   DW_AT_decl_file   : (data1) 6
+    <1d7>   DW_AT_decl_line   : (data2) 285
+    <1d9>   DW_AT_decl_column : (data1) 15
+    <1da>   DW_AT_type        : (ref4) <0x2a9>, _IO_lock_t
+    <1de>   DW_AT_data_member_location: (data1) 136
+ <2><1df>: Abbrev Number: 10 (DW_TAG_member)
+    <1e0>   DW_AT_name        : (strp) (offset: 0x1c2a): _offset
+    <1e4>   DW_AT_decl_file   : (data1) 6
+    <1e5>   DW_AT_decl_line   : (data2) 294
+    <1e7>   DW_AT_decl_column : (data1) 15
+    <1e8>   DW_AT_type        : (ref4) <0x79>, __off64_t, long int
+    <1ec>   DW_AT_data_member_location: (data1) 144
+ <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
+    <1ee>   DW_AT_name        : (strp) (offset: 0x1714): __pad1
+    <1f2>   DW_AT_decl_file   : (data1) 6
+    <1f3>   DW_AT_decl_line   : (data2) 303
+    <1f5>   DW_AT_decl_column : (data1) 9
+    <1f6>   DW_AT_type        : (ref4) <0x85>
+    <1fa>   DW_AT_data_member_location: (data1) 152
+ <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
+    <1fc>   DW_AT_name        : (strp) (offset: 0xced): __pad2
+    <200>   DW_AT_decl_file   : (data1) 6
+    <201>   DW_AT_decl_line   : (data2) 304
+    <203>   DW_AT_decl_column : (data1) 9
+    <204>   DW_AT_type        : (ref4) <0x85>
+    <208>   DW_AT_data_member_location: (data1) 160
+ <2><209>: Abbrev Number: 10 (DW_TAG_member)
+    <20a>   DW_AT_name        : (strp) (offset: 0x171b): __pad3
+    <20e>   DW_AT_decl_file   : (data1) 6
+    <20f>   DW_AT_decl_line   : (data2) 305
+    <211>   DW_AT_decl_column : (data1) 9
+    <212>   DW_AT_type        : (ref4) <0x85>
+    <216>   DW_AT_data_member_location: (data1) 168
+ <2><217>: Abbrev Number: 10 (DW_TAG_member)
+    <218>   DW_AT_name        : (strp) (offset: 0x1722): __pad4
+    <21c>   DW_AT_decl_file   : (data1) 6
+    <21d>   DW_AT_decl_line   : (data2) 306
+    <21f>   DW_AT_decl_column : (data1) 9
+    <220>   DW_AT_type        : (ref4) <0x85>
+    <224>   DW_AT_data_member_location: (data1) 176
+ <2><225>: Abbrev Number: 10 (DW_TAG_member)
+    <226>   DW_AT_name        : (strp) (offset: 0x1729): __pad5
+    <22a>   DW_AT_decl_file   : (data1) 6
+    <22b>   DW_AT_decl_line   : (data2) 307
+    <22d>   DW_AT_decl_column : (data1) 10
+    <22e>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
+    <232>   DW_AT_data_member_location: (data1) 184
+ <2><233>: Abbrev Number: 10 (DW_TAG_member)
+    <234>   DW_AT_name        : (strp) (offset: 0x127a): _mode
+    <238>   DW_AT_decl_file   : (data1) 6
+    <239>   DW_AT_decl_line   : (data2) 309
+    <23b>   DW_AT_decl_column : (data1) 7
+    <23c>   DW_AT_type        : (ref4) <0x5f>, int
+    <240>   DW_AT_data_member_location: (data1) 192
+ <2><241>: Abbrev Number: 10 (DW_TAG_member)
+    <242>   DW_AT_name        : (strp) (offset: 0x38): _unused2
+    <246>   DW_AT_decl_file   : (data1) 6
+    <247>   DW_AT_decl_line   : (data2) 311
+    <249>   DW_AT_decl_column : (data1) 8
+    <24a>   DW_AT_type        : (ref4) <0x2af>, char
+    <24e>   DW_AT_data_member_location: (data1) 196
+ <2><24f>: Abbrev Number: 0
+ <1><250>: Abbrev Number: 11 (DW_TAG_typedef)
+    <251>   DW_AT_name        : (strp) (offset: 0x7ad): _IO_lock_t
+    <255>   DW_AT_decl_file   : (data1) 6
+    <256>   DW_AT_decl_line   : (data1) 155
+    <257>   DW_AT_decl_column : (data1) 14
+ <1><258>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <259>   DW_AT_name        : (strp) (offset: 0x130c): _IO_marker
+    <25d>   DW_AT_byte_size   : (data1) 24
+    <25e>   DW_AT_decl_file   : (data1) 6
+    <25f>   DW_AT_decl_line   : (data1) 161
+    <260>   DW_AT_decl_column : (data1) 8
+    <261>   DW_AT_sibling     : (ref4) <0x28d>
+ <2><265>: Abbrev Number: 9 (DW_TAG_member)
+    <266>   DW_AT_name        : (strp) (offset: 0xda2): _next
+    <26a>   DW_AT_decl_file   : (data1) 6
+    <26b>   DW_AT_decl_line   : (data1) 162
+    <26c>   DW_AT_decl_column : (data1) 22
+    <26d>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
+    <271>   DW_AT_data_member_location: (data1) 0
+ <2><272>: Abbrev Number: 9 (DW_TAG_member)
+    <273>   DW_AT_name        : (strp) (offset: 0x105b): _sbuf
+    <277>   DW_AT_decl_file   : (data1) 6
+    <278>   DW_AT_decl_line   : (data1) 163
+    <279>   DW_AT_decl_column : (data1) 20
+    <27a>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
+    <27e>   DW_AT_data_member_location: (data1) 8
+ <2><27f>: Abbrev Number: 9 (DW_TAG_member)
+    <280>   DW_AT_name        : (strp) (offset: 0x177a): _pos
+    <284>   DW_AT_decl_file   : (data1) 6
+    <285>   DW_AT_decl_line   : (data1) 167
+    <286>   DW_AT_decl_column : (data1) 7
+    <287>   DW_AT_type        : (ref4) <0x5f>, int
+    <28b>   DW_AT_data_member_location: (data1) 16
+ <2><28c>: Abbrev Number: 0
+ <1><28d>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <28e>   DW_AT_byte_size   : (data1) 8
+    <28f>   DW_AT_type        : (ref4) <0x258>, _IO_marker
+ <1><293>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <294>   DW_AT_byte_size   : (data1) 8
+    <295>   DW_AT_type        : (ref4) <0xb1>, _IO_FILE
+ <1><299>: Abbrev Number: 12 (DW_TAG_array_type)
+    <29a>   DW_AT_type        : (ref4) <0x99>, char
+    <29e>   DW_AT_sibling     : (ref4) <0x2a9>
+ <2><2a2>: Abbrev Number: 13 (DW_TAG_subrange_type)
+    <2a3>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <2a7>   DW_AT_upper_bound : (data1) 0
+ <2><2a8>: Abbrev Number: 0
+ <1><2a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <2aa>   DW_AT_byte_size   : (data1) 8
+    <2ab>   DW_AT_type        : (ref4) <0x250>, _IO_lock_t
+ <1><2af>: Abbrev Number: 12 (DW_TAG_array_type)
+    <2b0>   DW_AT_type        : (ref4) <0x99>, char
+    <2b4>   DW_AT_sibling     : (ref4) <0x2bf>
+ <2><2b8>: Abbrev Number: 13 (DW_TAG_subrange_type)
+    <2b9>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <2bd>   DW_AT_upper_bound : (data1) 19
+ <2><2be>: Abbrev Number: 0
+ <1><2bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <2c0>   DW_AT_byte_size   : (data1) 8
+    <2c1>   DW_AT_type        : (ref4) <0xa0>, char
+ <1><2c5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2c6>   DW_AT_name        : (strp) (offset: 0xe4b): ssize_t
+    <2ca>   DW_AT_decl_file   : (data1) 5
+    <2cb>   DW_AT_decl_line   : (data1) 102
+    <2cc>   DW_AT_decl_column : (data1) 19
+    <2cd>   DW_AT_type        : (ref4) <0x87>, __ssize_t, long int
+ <1><2d1>: Abbrev Number: 14 (DW_TAG_typedef)
+    <2d2>   DW_AT_name        : (strp) (offset: 0x11e4): wchar_t
+    <2d6>   DW_AT_decl_file   : (data1) 3
+    <2d7>   DW_AT_decl_line   : (data2) 321
+    <2d9>   DW_AT_decl_column : (data1) 24
+    <2da>   DW_AT_type        : (ref4) <0x5f>, int
+ <1><2de>: Abbrev Number: 3 (DW_TAG_base_type)
+    <2df>   DW_AT_byte_size   : (data1) 8
+    <2e0>   DW_AT_encoding    : (data1) 5	(signed)
+    <2e1>   DW_AT_name        : (strp) (offset: 0x1c72): long long int
+ <1><2e5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2e6>   DW_AT_name        : (strp) (offset: 0x89b): int64_t
+    <2ea>   DW_AT_decl_file   : (data1) 7
+    <2eb>   DW_AT_decl_line   : (data1) 197
+    <2ec>   DW_AT_decl_column : (data1) 1
+    <2ed>   DW_AT_type        : (ref4) <0x66>, long int
+ <1><2f1>: Abbrev Number: 3 (DW_TAG_base_type)
+    <2f2>   DW_AT_byte_size   : (data1) 8
+    <2f3>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <2f4>   DW_AT_name        : (strp) (offset: 0x1a25): long long unsigned int
+ <1><2f8>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2f9>   DW_AT_name        : (strp) (offset: 0xb74): uint8_t
+    <2fd>   DW_AT_decl_file   : (data1) 8
+    <2fe>   DW_AT_decl_line   : (data1) 48
+    <2ff>   DW_AT_decl_column : (data1) 24
+    <300>   DW_AT_type        : (ref4) <0x3c>, unsigned char
+ <1><304>: Abbrev Number: 2 (DW_TAG_typedef)
+    <305>   DW_AT_name        : (strp) (offset: 0x221): uint16_t
+    <309>   DW_AT_decl_file   : (data1) 8
+    <30a>   DW_AT_decl_line   : (data1) 49
+    <30b>   DW_AT_decl_column : (data1) 28
+    <30c>   DW_AT_type        : (ref4) <0x43>, short unsigned int
+ <1><310>: Abbrev Number: 2 (DW_TAG_typedef)
+    <311>   DW_AT_name        : (strp) (offset: 0x13d8): uint32_t
+    <315>   DW_AT_decl_file   : (data1) 8
+    <316>   DW_AT_decl_line   : (data1) 51
+    <317>   DW_AT_decl_column : (data1) 23
+    <318>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+ <1><31c>: Abbrev Number: 2 (DW_TAG_typedef)
+    <31d>   DW_AT_name        : (strp) (offset: 0x89a): uint64_t
+    <321>   DW_AT_decl_file   : (data1) 8
+    <322>   DW_AT_decl_line   : (data1) 55
+    <323>   DW_AT_decl_column : (data1) 27
+    <324>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+ <1><328>: Abbrev Number: 2 (DW_TAG_typedef)
+    <329>   DW_AT_name        : (strp) (offset: 0x1c1b): Py_ssize_t
+    <32d>   DW_AT_decl_file   : (data1) 9
+    <32e>   DW_AT_decl_line   : (data1) 105
+    <32f>   DW_AT_decl_column : (data1) 25
+    <330>   DW_AT_type        : (ref4) <0x2c5>, ssize_t, __ssize_t, long int
+ <1><334>: Abbrev Number: 7 (DW_TAG_const_type)
+    <335>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><339>: Abbrev Number: 2 (DW_TAG_typedef)
+    <33a>   DW_AT_name        : (strp) (offset: 0xd8b): Py_hash_t
+    <33e>   DW_AT_decl_file   : (data1) 9
+    <33f>   DW_AT_decl_line   : (data1) 114
+    <340>   DW_AT_decl_column : (data1) 20
+    <341>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><345>: Abbrev Number: 3 (DW_TAG_base_type)
+    <346>   DW_AT_byte_size   : (data1) 4
+    <347>   DW_AT_encoding    : (data1) 4	(float)
+    <348>   DW_AT_name        : (strp) (offset: 0x1370): float
+ <1><34c>: Abbrev Number: 3 (DW_TAG_base_type)
+    <34d>   DW_AT_byte_size   : (data1) 8
+    <34e>   DW_AT_encoding    : (data1) 4	(float)
+    <34f>   DW_AT_name        : (strp) (offset: 0x349): double
+ <1><353>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <354>   DW_AT_name        : (strp) (offset: 0x1bdb): timezone
+    <358>   DW_AT_byte_size   : (data1) 8
+    <359>   DW_AT_decl_file   : (data1) 10
+    <35a>   DW_AT_decl_line   : (data1) 56
+    <35b>   DW_AT_decl_column : (data1) 8
+    <35c>   DW_AT_sibling     : (ref4) <0x37b>
+ <2><360>: Abbrev Number: 9 (DW_TAG_member)
+    <361>   DW_AT_name        : (strp) (offset: 0x1f0a): tz_minuteswest
+    <365>   DW_AT_decl_file   : (data1) 10
+    <366>   DW_AT_decl_line   : (data1) 58
+    <367>   DW_AT_decl_column : (data1) 9
+    <368>   DW_AT_type        : (ref4) <0x5f>, int
+    <36c>   DW_AT_data_member_location: (data1) 0
+ <2><36d>: Abbrev Number: 9 (DW_TAG_member)
+    <36e>   DW_AT_name        : (strp) (offset: 0x12ab): tz_dsttime
+    <372>   DW_AT_decl_file   : (data1) 10
+    <373>   DW_AT_decl_line   : (data1) 59
+    <374>   DW_AT_decl_column : (data1) 9
+    <375>   DW_AT_type        : (ref4) <0x5f>, int
+    <379>   DW_AT_data_member_location: (data1) 4
+ <2><37a>: Abbrev Number: 0
+ <1><37b>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <37c>   DW_AT_byte_size   : (data1) 8
+    <37d>   DW_AT_type        : (ref4) <0x353>, timezone
+ <1><381>: Abbrev Number: 15 (DW_TAG_restrict_type)
+    <382>   DW_AT_type        : (ref4) <0x37b>, timezone
+ <1><386>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <387>   DW_AT_name        : (strp) (offset: 0x47d): _object
+    <38b>   DW_AT_byte_size   : (data1) 16
+    <38c>   DW_AT_decl_file   : (data1) 2
+    <38d>   DW_AT_decl_line   : (data1) 104
+    <38e>   DW_AT_decl_column : (data1) 16
+    <38f>   DW_AT_sibling     : (ref4) <0x3ae>
+ <2><393>: Abbrev Number: 9 (DW_TAG_member)
+    <394>   DW_AT_name        : (strp) (offset: 0xfa): ob_refcnt
+    <398>   DW_AT_decl_file   : (data1) 2
+    <399>   DW_AT_decl_line   : (data1) 106
+    <39a>   DW_AT_decl_column : (data1) 16
+    <39b>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <39f>   DW_AT_data_member_location: (data1) 0
+ <2><3a0>: Abbrev Number: 9 (DW_TAG_member)
+    <3a1>   DW_AT_name        : (strp) (offset: 0x4d2): ob_type
+    <3a5>   DW_AT_decl_file   : (data1) 2
+    <3a6>   DW_AT_decl_line   : (data1) 107
+    <3a7>   DW_AT_decl_column : (data1) 25
+    <3a8>   DW_AT_type        : (ref4) <0x65e>, _typeobject
+    <3ac>   DW_AT_data_member_location: (data1) 8
+ <2><3ad>: Abbrev Number: 0
+ <1><3ae>: Abbrev Number: 16 (DW_TAG_structure_type)
+    <3af>   DW_AT_name        : (strp) (offset: 0x2ef): _typeobject
+    <3b3>   DW_AT_byte_size   : (data2) 416
+    <3b5>   DW_AT_decl_file   : (data1) 11
+    <3b6>   DW_AT_decl_line   : (data1) 177
+    <3b7>   DW_AT_decl_column : (data1) 16
+    <3b8>   DW_AT_sibling     : (ref4) <0x65e>
+ <2><3bc>: Abbrev Number: 9 (DW_TAG_member)
+    <3bd>   DW_AT_name        : (strp) (offset: 0x62c): ob_base
+    <3c1>   DW_AT_decl_file   : (data1) 11
+    <3c2>   DW_AT_decl_line   : (data1) 178
+    <3c3>   DW_AT_decl_column : (data1) 5
+    <3c4>   DW_AT_type        : (ref4) <0x694>, PyVarObject
+    <3c8>   DW_AT_data_member_location: (data1) 0
+ <2><3c9>: Abbrev Number: 9 (DW_TAG_member)
+    <3ca>   DW_AT_name        : (strp) (offset: 0x10a8): tp_name
+    <3ce>   DW_AT_decl_file   : (data1) 11
+    <3cf>   DW_AT_decl_line   : (data1) 179
+    <3d0>   DW_AT_decl_column : (data1) 17
+    <3d1>   DW_AT_type        : (ref4) <0x2bf>, char
+    <3d5>   DW_AT_data_member_location: (data1) 24
+ <2><3d6>: Abbrev Number: 9 (DW_TAG_member)
+    <3d7>   DW_AT_name        : (strp) (offset: 0x1e9e): tp_basicsize
+    <3db>   DW_AT_decl_file   : (data1) 11
+    <3dc>   DW_AT_decl_line   : (data1) 180
+    <3dd>   DW_AT_decl_column : (data1) 16
+    <3de>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3e2>   DW_AT_data_member_location: (data1) 32
+ <2><3e3>: Abbrev Number: 9 (DW_TAG_member)
+    <3e4>   DW_AT_name        : (strp) (offset: 0x20b): tp_itemsize
+    <3e8>   DW_AT_decl_file   : (data1) 11
+    <3e9>   DW_AT_decl_line   : (data1) 180
+    <3ea>   DW_AT_decl_column : (data1) 30
+    <3eb>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3ef>   DW_AT_data_member_location: (data1) 40
+ <2><3f0>: Abbrev Number: 9 (DW_TAG_member)
+    <3f1>   DW_AT_name        : (strp) (offset: 0x2e4): tp_dealloc
+    <3f5>   DW_AT_decl_file   : (data1) 11
+    <3f6>   DW_AT_decl_line   : (data1) 184
+    <3f7>   DW_AT_decl_column : (data1) 16
+    <3f8>   DW_AT_type        : (ref4) <0x86f>, destructor
+    <3fc>   DW_AT_data_member_location: (data1) 48
+ <2><3fd>: Abbrev Number: 9 (DW_TAG_member)
+    <3fe>   DW_AT_name        : (strp) (offset: 0x13bb): tp_vectorcall_offset
+    <402>   DW_AT_decl_file   : (data1) 11
+    <403>   DW_AT_decl_line   : (data1) 185
+    <404>   DW_AT_decl_column : (data1) 16
+    <405>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <409>   DW_AT_data_member_location: (data1) 56
+ <2><40a>: Abbrev Number: 9 (DW_TAG_member)
+    <40b>   DW_AT_name        : (strp) (offset: 0xae): tp_getattr
+    <40f>   DW_AT_decl_file   : (data1) 11
+    <410>   DW_AT_decl_line   : (data1) 186
+    <411>   DW_AT_decl_column : (data1) 17
+    <412>   DW_AT_type        : (ref4) <0x88c>, getattrfunc, PyObject, _object
+    <416>   DW_AT_data_member_location: (data1) 64
+ <2><417>: Abbrev Number: 9 (DW_TAG_member)
+    <418>   DW_AT_name        : (strp) (offset: 0x72c): tp_setattr
+    <41c>   DW_AT_decl_file   : (data1) 11
+    <41d>   DW_AT_decl_line   : (data1) 187
+    <41e>   DW_AT_decl_column : (data1) 17
+    <41f>   DW_AT_type        : (ref4) <0x8be>, setattrfunc, int
+    <423>   DW_AT_data_member_location: (data1) 72
+ <2><424>: Abbrev Number: 9 (DW_TAG_member)
+    <425>   DW_AT_name        : (strp) (offset: 0x140): tp_as_async
+    <429>   DW_AT_decl_file   : (data1) 11
+    <42a>   DW_AT_decl_line   : (data1) 188
+    <42b>   DW_AT_decl_column : (data1) 21
+    <42c>   DW_AT_type        : (ref4) <0xe5c>, PyAsyncMethods
+    <430>   DW_AT_data_member_location: (data1) 80
+ <2><431>: Abbrev Number: 9 (DW_TAG_member)
+    <432>   DW_AT_name        : (strp) (offset: 0x1be4): tp_repr
+    <436>   DW_AT_decl_file   : (data1) 11
+    <437>   DW_AT_decl_line   : (data1) 190
+    <438>   DW_AT_decl_column : (data1) 14
+    <439>   DW_AT_type        : (ref4) <0x8f5>, reprfunc, PyObject, _object
+    <43d>   DW_AT_data_member_location: (data1) 88
+ <2><43e>: Abbrev Number: 9 (DW_TAG_member)
+    <43f>   DW_AT_name        : (strp) (offset: 0x1433): tp_as_number
+    <443>   DW_AT_decl_file   : (data1) 11
+    <444>   DW_AT_decl_line   : (data1) 194
+    <445>   DW_AT_decl_column : (data1) 22
+    <446>   DW_AT_type        : (ref4) <0xe62>, PyNumberMethods
+    <44a>   DW_AT_data_member_location: (data1) 96
+ <2><44b>: Abbrev Number: 9 (DW_TAG_member)
+    <44c>   DW_AT_name        : (strp) (offset: 0x1102): tp_as_sequence
+    <450>   DW_AT_decl_file   : (data1) 11
+    <451>   DW_AT_decl_line   : (data1) 195
+    <452>   DW_AT_decl_column : (data1) 24
+    <453>   DW_AT_type        : (ref4) <0xe68>, PySequenceMethods
+    <457>   DW_AT_data_member_location: (data1) 104
+ <2><458>: Abbrev Number: 9 (DW_TAG_member)
+    <459>   DW_AT_name        : (strp) (offset: 0x9f8): tp_as_mapping
+    <45d>   DW_AT_decl_file   : (data1) 11
+    <45e>   DW_AT_decl_line   : (data1) 196
+    <45f>   DW_AT_decl_column : (data1) 23
+    <460>   DW_AT_type        : (ref4) <0xe6e>, PyMappingMethods
+    <464>   DW_AT_data_member_location: (data1) 112
+ <2><465>: Abbrev Number: 9 (DW_TAG_member)
+    <466>   DW_AT_name        : (strp) (offset: 0x1696): tp_hash
+    <46a>   DW_AT_decl_file   : (data1) 11
+    <46b>   DW_AT_decl_line   : (data1) 200
+    <46c>   DW_AT_decl_column : (data1) 14
+    <46d>   DW_AT_type        : (ref4) <0x901>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
+    <471>   DW_AT_data_member_location: (data1) 120
+ <2><472>: Abbrev Number: 9 (DW_TAG_member)
+    <473>   DW_AT_name        : (strp) (offset: 0x5a0): tp_call
+    <477>   DW_AT_decl_file   : (data1) 11
+    <478>   DW_AT_decl_line   : (data1) 201
+    <479>   DW_AT_decl_column : (data1) 17
+    <47a>   DW_AT_type        : (ref4) <0x6f2>, ternaryfunc, PyObject, _object
+    <47e>   DW_AT_data_member_location: (data1) 128
+ <2><47f>: Abbrev Number: 9 (DW_TAG_member)
+    <480>   DW_AT_name        : (strp) (offset: 0x5d8): tp_str
+    <484>   DW_AT_decl_file   : (data1) 11
+    <485>   DW_AT_decl_line   : (data1) 202
+    <486>   DW_AT_decl_column : (data1) 14
+    <487>   DW_AT_type        : (ref4) <0x8f5>, reprfunc, PyObject, _object
+    <48b>   DW_AT_data_member_location: (data1) 136
+ <2><48c>: Abbrev Number: 9 (DW_TAG_member)
+    <48d>   DW_AT_name        : (strp) (offset: 0x1248): tp_getattro
+    <491>   DW_AT_decl_file   : (data1) 11
+    <492>   DW_AT_decl_line   : (data1) 203
+    <493>   DW_AT_decl_column : (data1) 18
+    <494>   DW_AT_type        : (ref4) <0x8b2>, getattrofunc, PyObject, _object
+    <498>   DW_AT_data_member_location: (data1) 144
+ <2><499>: Abbrev Number: 9 (DW_TAG_member)
+    <49a>   DW_AT_name        : (strp) (offset: 0x189a): tp_setattro
+    <49e>   DW_AT_decl_file   : (data1) 11
+    <49f>   DW_AT_decl_line   : (data1) 204
+    <4a0>   DW_AT_decl_column : (data1) 18
+    <4a1>   DW_AT_type        : (ref4) <0x8e9>, setattrofunc, int
+    <4a5>   DW_AT_data_member_location: (data1) 152
+ <2><4a6>: Abbrev Number: 9 (DW_TAG_member)
+    <4a7>   DW_AT_name        : (strp) (offset: 0x1129): tp_as_buffer
+    <4ab>   DW_AT_decl_file   : (data1) 11
+    <4ac>   DW_AT_decl_line   : (data1) 207
+    <4ad>   DW_AT_decl_column : (data1) 20
+    <4ae>   DW_AT_type        : (ref4) <0xe74>, PyBufferProcs
+    <4b2>   DW_AT_data_member_location: (data1) 160
+ <2><4b3>: Abbrev Number: 9 (DW_TAG_member)
+    <4b4>   DW_AT_name        : (strp) (offset: 0x1d3c): tp_flags
+    <4b8>   DW_AT_decl_file   : (data1) 11
+    <4b9>   DW_AT_decl_line   : (data1) 210
+    <4ba>   DW_AT_decl_column : (data1) 19
+    <4bb>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <4bf>   DW_AT_data_member_location: (data1) 168
+ <2><4c0>: Abbrev Number: 9 (DW_TAG_member)
+    <4c1>   DW_AT_name        : (strp) (offset: 0x14f3): tp_doc
+    <4c5>   DW_AT_decl_file   : (data1) 11
+    <4c6>   DW_AT_decl_line   : (data1) 212
+    <4c7>   DW_AT_decl_column : (data1) 17
+    <4c8>   DW_AT_type        : (ref4) <0x2bf>, char
+    <4cc>   DW_AT_data_member_location: (data1) 176
+ <2><4cd>: Abbrev Number: 9 (DW_TAG_member)
+    <4ce>   DW_AT_name        : (strp) (offset: 0x17fc): tp_traverse
+    <4d2>   DW_AT_decl_file   : (data1) 11
+    <4d3>   DW_AT_decl_line   : (data1) 216
+    <4d4>   DW_AT_decl_column : (data1) 18
+    <4d5>   DW_AT_type        : (ref4) <0x827>, traverseproc, int
+    <4d9>   DW_AT_data_member_location: (data1) 184
+ <2><4da>: Abbrev Number: 9 (DW_TAG_member)
+    <4db>   DW_AT_name        : (strp) (offset: 0x885): tp_clear
     <4df>   DW_AT_decl_file   : (data1) 11
-    <4e0>   DW_AT_decl_line   : (data1) 247
-    <4e1>   DW_AT_decl_column : (data1) 15
-    <4e2>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <4e6>   DW_AT_data_member_location: (data2) 344
- <2><4e8>: Abbrev Number: 19 (DW_TAG_member)
-    <4e9>   DW_AT_name        : (strp) (offset: 0x238f): tp_cache
-    <4ed>   DW_AT_decl_file   : (data1) 11
-    <4ee>   DW_AT_decl_line   : (data1) 248
-    <4ef>   DW_AT_decl_column : (data1) 15
-    <4f0>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <4f4>   DW_AT_data_member_location: (data2) 352
- <2><4f6>: Abbrev Number: 19 (DW_TAG_member)
-    <4f7>   DW_AT_name        : (strp) (offset: 0x2c62): tp_subclasses
-    <4fb>   DW_AT_decl_file   : (data1) 11
-    <4fc>   DW_AT_decl_line   : (data1) 249
-    <4fd>   DW_AT_decl_column : (data1) 15
-    <4fe>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <502>   DW_AT_data_member_location: (data2) 360
- <2><504>: Abbrev Number: 19 (DW_TAG_member)
-    <505>   DW_AT_name        : (strp) (offset: 0x2114): tp_weaklist
-    <509>   DW_AT_decl_file   : (data1) 11
-    <50a>   DW_AT_decl_line   : (data1) 250
-    <50b>   DW_AT_decl_column : (data1) 15
-    <50c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <510>   DW_AT_data_member_location: (data2) 368
- <2><512>: Abbrev Number: 19 (DW_TAG_member)
-    <513>   DW_AT_name        : (strp) (offset: 0x2886): tp_del
-    <517>   DW_AT_decl_file   : (data1) 11
-    <518>   DW_AT_decl_line   : (data1) 251
-    <519>   DW_AT_decl_column : (data1) 16
-    <51a>   DW_AT_type        : (ref4) <0x76d>, destructor
-    <51e>   DW_AT_data_member_location: (data2) 376
- <2><520>: Abbrev Number: 19 (DW_TAG_member)
-    <521>   DW_AT_name        : (strp) (offset: 0x2323): tp_version_tag
-    <525>   DW_AT_decl_file   : (data1) 11
-    <526>   DW_AT_decl_line   : (data1) 254
-    <527>   DW_AT_decl_column : (data1) 18
-    <528>   DW_AT_type        : (ref4) <0x52>, unsigned int
-    <52c>   DW_AT_data_member_location: (data2) 384
- <2><52e>: Abbrev Number: 20 (DW_TAG_member)
-    <52f>   DW_AT_name        : (strp) (offset: 0x2778): tp_finalize
-    <533>   DW_AT_decl_file   : (data1) 11
-    <534>   DW_AT_decl_line   : (data2) 256
-    <536>   DW_AT_decl_column : (data1) 16
-    <537>   DW_AT_type        : (ref4) <0x76d>, destructor
-    <53b>   DW_AT_data_member_location: (data2) 392
- <2><53d>: Abbrev Number: 20 (DW_TAG_member)
-    <53e>   DW_AT_name        : (strp) (offset: 0x219a): tp_vectorcall
-    <542>   DW_AT_decl_file   : (data1) 11
-    <543>   DW_AT_decl_line   : (data2) 257
-    <545>   DW_AT_decl_column : (data1) 20
-    <546>   DW_AT_type        : (ref4) <0xa18>, vectorcallfunc, PyObject, _object
-    <54a>   DW_AT_data_member_location: (data2) 400
- <2><54c>: Abbrev Number: 20 (DW_TAG_member)
-    <54d>   DW_AT_name        : (strp) (offset: 0x231a): tp_print
-    <551>   DW_AT_decl_file   : (data1) 11
-    <552>   DW_AT_decl_line   : (data2) 260
-    <554>   DW_AT_decl_column : (data1) 30
-    <555>   DW_AT_type        : (ref4) <0xe5e>, int
-    <559>   DW_AT_data_member_location: (data2) 408
- <2><55b>: Abbrev Number: 0
- <1><55c>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <55d>   DW_AT_byte_size   : (data1) 8
-    <55e>   DW_AT_type        : (ref4) <0x2ac>, _typeobject
- <1><562>: Abbrev Number: 5 (DW_TAG_typedef)
-    <563>   DW_AT_name        : (strp) (offset: 0x181a): PyObject
-    <567>   DW_AT_decl_file   : (data1) 2
-    <568>   DW_AT_decl_line   : (data1) 108
-    <569>   DW_AT_decl_column : (data1) 3
-    <56a>   DW_AT_type        : (ref4) <0x284>, _object
- <1><56e>: Abbrev Number: 21 (DW_TAG_structure_type)
-    <56f>   DW_AT_byte_size   : (data1) 24
-    <570>   DW_AT_decl_file   : (data1) 2
-    <571>   DW_AT_decl_line   : (data1) 113
-    <572>   DW_AT_decl_column : (data1) 9
-    <573>   DW_AT_sibling     : (ref4) <0x592>
- <2><577>: Abbrev Number: 17 (DW_TAG_member)
-    <578>   DW_AT_name        : (strp) (offset: 0x41c): ob_base
-    <57c>   DW_AT_decl_file   : (data1) 2
-    <57d>   DW_AT_decl_line   : (data1) 114
-    <57e>   DW_AT_decl_column : (data1) 14
-    <57f>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
-    <583>   DW_AT_data_member_location: (data1) 0
- <2><584>: Abbrev Number: 17 (DW_TAG_member)
-    <585>   DW_AT_name        : (strp) (offset: 0x1812): ob_size
-    <589>   DW_AT_decl_file   : (data1) 2
-    <58a>   DW_AT_decl_line   : (data1) 115
-    <58b>   DW_AT_decl_column : (data1) 16
-    <58c>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <590>   DW_AT_data_member_location: (data1) 16
- <2><591>: Abbrev Number: 0
- <1><592>: Abbrev Number: 5 (DW_TAG_typedef)
-    <593>   DW_AT_name        : (strp) (offset: 0xe8f): PyVarObject
-    <597>   DW_AT_decl_file   : (data1) 2
-    <598>   DW_AT_decl_line   : (data1) 116
-    <599>   DW_AT_decl_column : (data1) 3
-    <59a>   DW_AT_type        : (ref4) <0x56e>
- <1><59e>: Abbrev Number: 5 (DW_TAG_typedef)
-    <59f>   DW_AT_name        : (strp) (offset: 0x10ab): unaryfunc
-    <5a3>   DW_AT_decl_file   : (data1) 2
-    <5a4>   DW_AT_decl_line   : (data1) 140
-    <5a5>   DW_AT_decl_column : (data1) 22
-    <5a6>   DW_AT_type        : (ref4) <0x5aa>, PyObject, _object
- <1><5aa>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5ab>   DW_AT_byte_size   : (data1) 8
-    <5ac>   DW_AT_type        : (ref4) <0x5b0>, PyObject, _object
- <1><5b0>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <5b1>   DW_AT_prototyped  : (flag_present) 1
-    <5b1>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <5b5>   DW_AT_sibling     : (ref4) <0x5bf>
- <2><5b9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <5ba>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><5be>: Abbrev Number: 0
- <1><5bf>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5c0>   DW_AT_byte_size   : (data1) 8
-    <5c1>   DW_AT_type        : (ref4) <0x562>, PyObject, _object
- <1><5c5>: Abbrev Number: 3 (DW_TAG_const_type)
-    <5c6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <1><5ca>: Abbrev Number: 5 (DW_TAG_typedef)
-    <5cb>   DW_AT_name        : (strp) (offset: 0x23cb): binaryfunc
-    <5cf>   DW_AT_decl_file   : (data1) 2
-    <5d0>   DW_AT_decl_line   : (data1) 141
-    <5d1>   DW_AT_decl_column : (data1) 22
-    <5d2>   DW_AT_type        : (ref4) <0x5d6>, PyObject, _object
- <1><5d6>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5d7>   DW_AT_byte_size   : (data1) 8
-    <5d8>   DW_AT_type        : (ref4) <0x5dc>, PyObject, _object
- <1><5dc>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <5dd>   DW_AT_prototyped  : (flag_present) 1
-    <5dd>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <5e1>   DW_AT_sibling     : (ref4) <0x5f0>
- <2><5e5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <5e6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><5ea>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <5eb>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><5ef>: Abbrev Number: 0
- <1><5f0>: Abbrev Number: 5 (DW_TAG_typedef)
-    <5f1>   DW_AT_name        : (strp) (offset: 0x615): ternaryfunc
-    <5f5>   DW_AT_decl_file   : (data1) 2
-    <5f6>   DW_AT_decl_line   : (data1) 142
-    <5f7>   DW_AT_decl_column : (data1) 22
-    <5f8>   DW_AT_type        : (ref4) <0x5fc>, PyObject, _object
- <1><5fc>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <5fd>   DW_AT_byte_size   : (data1) 8
-    <5fe>   DW_AT_type        : (ref4) <0x602>, PyObject, _object
- <1><602>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <603>   DW_AT_prototyped  : (flag_present) 1
-    <603>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <607>   DW_AT_sibling     : (ref4) <0x61b>
- <2><60b>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <60c>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><610>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <611>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><615>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <616>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><61a>: Abbrev Number: 0
- <1><61b>: Abbrev Number: 5 (DW_TAG_typedef)
-    <61c>   DW_AT_name        : (strp) (offset: 0x18f3): inquiry
-    <620>   DW_AT_decl_file   : (data1) 2
-    <621>   DW_AT_decl_line   : (data1) 143
-    <622>   DW_AT_decl_column : (data1) 15
-    <623>   DW_AT_type        : (ref4) <0x627>, int
- <1><627>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <628>   DW_AT_byte_size   : (data1) 8
-    <629>   DW_AT_type        : (ref4) <0x62d>, int
- <1><62d>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <62e>   DW_AT_prototyped  : (flag_present) 1
-    <62e>   DW_AT_type        : (ref4) <0xe6>, int
-    <632>   DW_AT_sibling     : (ref4) <0x63c>
- <2><636>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <637>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><63b>: Abbrev Number: 0
- <1><63c>: Abbrev Number: 5 (DW_TAG_typedef)
-    <63d>   DW_AT_name        : (strp) (offset: 0xf8c): lenfunc
-    <641>   DW_AT_decl_file   : (data1) 2
-    <642>   DW_AT_decl_line   : (data1) 144
-    <643>   DW_AT_decl_column : (data1) 22
-    <644>   DW_AT_type        : (ref4) <0x648>, Py_ssize_t, ssize_t, long int
- <1><648>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <649>   DW_AT_byte_size   : (data1) 8
-    <64a>   DW_AT_type        : (ref4) <0x64e>, Py_ssize_t, ssize_t, long int
- <1><64e>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <64f>   DW_AT_prototyped  : (flag_present) 1
-    <64f>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
-    <653>   DW_AT_sibling     : (ref4) <0x65d>
- <2><657>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <658>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><65c>: Abbrev Number: 0
- <1><65d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <65e>   DW_AT_name        : (strp) (offset: 0x1638): ssizeargfunc
-    <662>   DW_AT_decl_file   : (data1) 2
-    <663>   DW_AT_decl_line   : (data1) 145
-    <664>   DW_AT_decl_column : (data1) 21
-    <665>   DW_AT_type        : (ref4) <0x669>, PyObject, _object
- <1><669>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <66a>   DW_AT_byte_size   : (data1) 8
-    <66b>   DW_AT_type        : (ref4) <0x66f>, PyObject, _object
- <1><66f>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <670>   DW_AT_prototyped  : (flag_present) 1
-    <670>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <674>   DW_AT_sibling     : (ref4) <0x683>
- <2><678>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <679>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><67d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <67e>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <2><682>: Abbrev Number: 0
- <1><683>: Abbrev Number: 5 (DW_TAG_typedef)
-    <684>   DW_AT_name        : (strp) (offset: 0x26b): ssizeobjargproc
-    <688>   DW_AT_decl_file   : (data1) 2
-    <689>   DW_AT_decl_line   : (data1) 147
-    <68a>   DW_AT_decl_column : (data1) 14
-    <68b>   DW_AT_type        : (ref4) <0x68f>, int
- <1><68f>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <690>   DW_AT_byte_size   : (data1) 8
-    <691>   DW_AT_type        : (ref4) <0x695>, int
- <1><695>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <696>   DW_AT_prototyped  : (flag_present) 1
-    <696>   DW_AT_type        : (ref4) <0xe6>, int
-    <69a>   DW_AT_sibling     : (ref4) <0x6ae>
- <2><69e>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <69f>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6a3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6a4>   DW_AT_type        : (ref4) <0x1a4>, Py_ssize_t, ssize_t, long int
- <2><6a8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6a9>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6ad>: Abbrev Number: 0
- <1><6ae>: Abbrev Number: 5 (DW_TAG_typedef)
-    <6af>   DW_AT_name        : (strp) (offset: 0x21a8): objobjargproc
-    <6b3>   DW_AT_decl_file   : (data1) 2
-    <6b4>   DW_AT_decl_line   : (data1) 149
-    <6b5>   DW_AT_decl_column : (data1) 14
-    <6b6>   DW_AT_type        : (ref4) <0x6ba>, int
- <1><6ba>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <6bb>   DW_AT_byte_size   : (data1) 8
-    <6bc>   DW_AT_type        : (ref4) <0x6c0>, int
- <1><6c0>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <6c1>   DW_AT_prototyped  : (flag_present) 1
-    <6c1>   DW_AT_type        : (ref4) <0xe6>, int
-    <6c5>   DW_AT_sibling     : (ref4) <0x6d9>
- <2><6c9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6ca>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6ce>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6cf>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6d3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6d4>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6d8>: Abbrev Number: 0
- <1><6d9>: Abbrev Number: 5 (DW_TAG_typedef)
-    <6da>   DW_AT_name        : (strp) (offset: 0x113): objobjproc
-    <6de>   DW_AT_decl_file   : (data1) 2
-    <6df>   DW_AT_decl_line   : (data1) 151
-    <6e0>   DW_AT_decl_column : (data1) 15
-    <6e1>   DW_AT_type        : (ref4) <0x6e5>, int
- <1><6e5>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <6e6>   DW_AT_byte_size   : (data1) 8
-    <6e7>   DW_AT_type        : (ref4) <0x6eb>, int
- <1><6eb>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <6ec>   DW_AT_prototyped  : (flag_present) 1
-    <6ec>   DW_AT_type        : (ref4) <0xe6>, int
-    <6f0>   DW_AT_sibling     : (ref4) <0x6ff>
- <2><6f4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6f5>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6f9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <6fa>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><6fe>: Abbrev Number: 0
- <1><6ff>: Abbrev Number: 5 (DW_TAG_typedef)
-    <700>   DW_AT_name        : (strp) (offset: 0x1da7): visitproc
-    <704>   DW_AT_decl_file   : (data1) 2
-    <705>   DW_AT_decl_line   : (data1) 152
-    <706>   DW_AT_decl_column : (data1) 15
-    <707>   DW_AT_type        : (ref4) <0x70b>, int
- <1><70b>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <70c>   DW_AT_byte_size   : (data1) 8
-    <70d>   DW_AT_type        : (ref4) <0x711>, int
- <1><711>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <712>   DW_AT_prototyped  : (flag_present) 1
-    <712>   DW_AT_type        : (ref4) <0xe6>, int
-    <716>   DW_AT_sibling     : (ref4) <0x725>
- <2><71a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <71b>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><71f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <720>   DW_AT_type        : (ref4) <0x5e>
- <2><724>: Abbrev Number: 0
- <1><725>: Abbrev Number: 5 (DW_TAG_typedef)
-    <726>   DW_AT_name        : (strp) (offset: 0x1225): traverseproc
-    <72a>   DW_AT_decl_file   : (data1) 2
-    <72b>   DW_AT_decl_line   : (data1) 153
-    <72c>   DW_AT_decl_column : (data1) 15
-    <72d>   DW_AT_type        : (ref4) <0x731>, int
- <1><731>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <732>   DW_AT_byte_size   : (data1) 8
-    <733>   DW_AT_type        : (ref4) <0x737>, int
- <1><737>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <738>   DW_AT_prototyped  : (flag_present) 1
-    <738>   DW_AT_type        : (ref4) <0xe6>, int
-    <73c>   DW_AT_sibling     : (ref4) <0x750>
- <2><740>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <741>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><745>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <746>   DW_AT_type        : (ref4) <0x6ff>, visitproc, int
- <2><74a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <74b>   DW_AT_type        : (ref4) <0x5e>
- <2><74f>: Abbrev Number: 0
- <1><750>: Abbrev Number: 5 (DW_TAG_typedef)
-    <751>   DW_AT_name        : (strp) (offset: 0x202a): freefunc
-    <755>   DW_AT_decl_file   : (data1) 2
-    <756>   DW_AT_decl_line   : (data1) 156
-    <757>   DW_AT_decl_column : (data1) 16
-    <758>   DW_AT_type        : (ref4) <0x75c>
- <1><75c>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <75d>   DW_AT_byte_size   : (data1) 8
-    <75e>   DW_AT_type        : (ref4) <0x762>
- <1><762>: Abbrev Number: 24 (DW_TAG_subroutine_type)
-    <763>   DW_AT_prototyped  : (flag_present) 1
-    <763>   DW_AT_sibling     : (ref4) <0x76d>
- <2><767>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <768>   DW_AT_type        : (ref4) <0x5e>
- <2><76c>: Abbrev Number: 0
- <1><76d>: Abbrev Number: 5 (DW_TAG_typedef)
-    <76e>   DW_AT_name        : (strp) (offset: 0x28a5): destructor
-    <772>   DW_AT_decl_file   : (data1) 2
-    <773>   DW_AT_decl_line   : (data1) 157
-    <774>   DW_AT_decl_column : (data1) 16
-    <775>   DW_AT_type        : (ref4) <0x779>
- <1><779>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <77a>   DW_AT_byte_size   : (data1) 8
-    <77b>   DW_AT_type        : (ref4) <0x77f>
- <1><77f>: Abbrev Number: 24 (DW_TAG_subroutine_type)
-    <780>   DW_AT_prototyped  : (flag_present) 1
-    <780>   DW_AT_sibling     : (ref4) <0x78a>
- <2><784>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <785>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><789>: Abbrev Number: 0
- <1><78a>: Abbrev Number: 5 (DW_TAG_typedef)
-    <78b>   DW_AT_name        : (strp) (offset: 0x26f2): getattrfunc
-    <78f>   DW_AT_decl_file   : (data1) 2
-    <790>   DW_AT_decl_line   : (data1) 158
-    <791>   DW_AT_decl_column : (data1) 21
-    <792>   DW_AT_type        : (ref4) <0x796>, PyObject, _object
- <1><796>: Abbrev Number: 9 (DW_TAG_pointer_type)
-    <797>   DW_AT_byte_size   : (data1) 8
-    <798>   DW_AT_type        : (ref4) <0x79c>, PyObject, _object
- <1><79c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <79d>   DW_AT_prototyped  : (flag_present) 1
-    <79d>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
-    <7a1>   DW_AT_sibling     : (ref4) <0x7b0>
- <2><7a5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7a6>   DW_AT_type        : (ref4) <0x5bf>, PyObject, _object
- <2><7aa>: Abbrev Number: 23 (DW_TAG_formal_parameter)
-    <7ab>   DW_AT_type        : (ref4) <0xda>, char
+    <4e0>   DW_AT_decl_line   : (data1) 219
+    <4e1>   DW_AT_decl_column : (data1) 13
+    <4e2>   DW_AT_type        : (ref4) <0x71d>, inquiry, int
+    <4e6>   DW_AT_data_member_location: (data1) 192
+ <2><4e7>: Abbrev Number: 9 (DW_TAG_member)
+    <4e8>   DW_AT_name        : (strp) (offset: 0x3bb): tp_richcompare
+    <4ec>   DW_AT_decl_file   : (data1) 11
+    <4ed>   DW_AT_decl_line   : (data1) 223
+    <4ee>   DW_AT_decl_column : (data1) 17
+    <4ef>   DW_AT_type        : (ref4) <0x922>, richcmpfunc, PyObject, _object
+    <4f3>   DW_AT_data_member_location: (data1) 200
+ <2><4f4>: Abbrev Number: 9 (DW_TAG_member)
+    <4f5>   DW_AT_name        : (strp) (offset: 0x146b): tp_weaklistoffset
+    <4f9>   DW_AT_decl_file   : (data1) 11
+    <4fa>   DW_AT_decl_line   : (data1) 226
+    <4fb>   DW_AT_decl_column : (data1) 16
+    <4fc>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <500>   DW_AT_data_member_location: (data1) 208
+ <2><501>: Abbrev Number: 9 (DW_TAG_member)
+    <502>   DW_AT_name        : (strp) (offset: 0x192e): tp_iter
+    <506>   DW_AT_decl_file   : (data1) 11
+    <507>   DW_AT_decl_line   : (data1) 229
+    <508>   DW_AT_decl_column : (data1) 17
+    <509>   DW_AT_type        : (ref4) <0x94d>, getiterfunc, PyObject, _object
+    <50d>   DW_AT_data_member_location: (data1) 216
+ <2><50e>: Abbrev Number: 9 (DW_TAG_member)
+    <50f>   DW_AT_name        : (strp) (offset: 0x18fb): tp_iternext
+    <513>   DW_AT_decl_file   : (data1) 11
+    <514>   DW_AT_decl_line   : (data1) 230
+    <515>   DW_AT_decl_column : (data1) 18
+    <516>   DW_AT_type        : (ref4) <0x959>, iternextfunc, PyObject, _object
+    <51a>   DW_AT_data_member_location: (data1) 224
+ <2><51b>: Abbrev Number: 9 (DW_TAG_member)
+    <51c>   DW_AT_name        : (strp) (offset: 0x1280): tp_methods
+    <520>   DW_AT_decl_file   : (data1) 11
+    <521>   DW_AT_decl_line   : (data1) 233
+    <522>   DW_AT_decl_column : (data1) 25
+    <523>   DW_AT_type        : (ref4) <0xebc>, PyMethodDef
+    <527>   DW_AT_data_member_location: (data1) 232
+ <2><528>: Abbrev Number: 9 (DW_TAG_member)
+    <529>   DW_AT_name        : (strp) (offset: 0x17db): tp_members
+    <52d>   DW_AT_decl_file   : (data1) 11
+    <52e>   DW_AT_decl_line   : (data1) 234
+    <52f>   DW_AT_decl_column : (data1) 25
+    <530>   DW_AT_type        : (ref4) <0xec7>, PyMemberDef
+    <534>   DW_AT_data_member_location: (data1) 240
+ <2><535>: Abbrev Number: 9 (DW_TAG_member)
+    <536>   DW_AT_name        : (strp) (offset: 0x18e8): tp_getset
+    <53a>   DW_AT_decl_file   : (data1) 11
+    <53b>   DW_AT_decl_line   : (data1) 235
+    <53c>   DW_AT_decl_column : (data1) 25
+    <53d>   DW_AT_type        : (ref4) <0xf1c>, PyGetSetDef
+    <541>   DW_AT_data_member_location: (data1) 248
+ <2><542>: Abbrev Number: 17 (DW_TAG_member)
+    <543>   DW_AT_name        : (strp) (offset: 0x199a): tp_base
+    <547>   DW_AT_decl_file   : (data1) 11
+    <548>   DW_AT_decl_line   : (data1) 236
+    <549>   DW_AT_decl_column : (data1) 25
+    <54a>   DW_AT_type        : (ref4) <0x65e>, _typeobject
+    <54e>   DW_AT_data_member_location: (data2) 256
+ <2><550>: Abbrev Number: 17 (DW_TAG_member)
+    <551>   DW_AT_name        : (strp) (offset: 0x9c6): tp_dict
+    <555>   DW_AT_decl_file   : (data1) 11
+    <556>   DW_AT_decl_line   : (data1) 237
+    <557>   DW_AT_decl_column : (data1) 15
+    <558>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <55c>   DW_AT_data_member_location: (data2) 264
+ <2><55e>: Abbrev Number: 17 (DW_TAG_member)
+    <55f>   DW_AT_name        : (strp) (offset: 0x1921): tp_descr_get
+    <563>   DW_AT_decl_file   : (data1) 11
+    <564>   DW_AT_decl_line   : (data1) 238
+    <565>   DW_AT_decl_column : (data1) 18
+    <566>   DW_AT_type        : (ref4) <0x965>, descrgetfunc, PyObject, _object
+    <56a>   DW_AT_data_member_location: (data2) 272
+ <2><56c>: Abbrev Number: 17 (DW_TAG_member)
+    <56d>   DW_AT_name        : (strp) (offset: 0x1e1c): tp_descr_set
+    <571>   DW_AT_decl_file   : (data1) 11
+    <572>   DW_AT_decl_line   : (data1) 239
+    <573>   DW_AT_decl_column : (data1) 18
+    <574>   DW_AT_type        : (ref4) <0x971>, descrsetfunc, int
+    <578>   DW_AT_data_member_location: (data2) 280
+ <2><57a>: Abbrev Number: 17 (DW_TAG_member)
+    <57b>   DW_AT_name        : (strp) (offset: 0x7d6): tp_dictoffset
+    <57f>   DW_AT_decl_file   : (data1) 11
+    <580>   DW_AT_decl_line   : (data1) 240
+    <581>   DW_AT_decl_column : (data1) 16
+    <582>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <586>   DW_AT_data_member_location: (data2) 288
+ <2><588>: Abbrev Number: 17 (DW_TAG_member)
+    <589>   DW_AT_name        : (strp) (offset: 0x95d): tp_init
+    <58d>   DW_AT_decl_file   : (data1) 11
+    <58e>   DW_AT_decl_line   : (data1) 241
+    <58f>   DW_AT_decl_column : (data1) 14
+    <590>   DW_AT_type        : (ref4) <0x97d>, initproc, int
+    <594>   DW_AT_data_member_location: (data2) 296
+ <2><596>: Abbrev Number: 17 (DW_TAG_member)
+    <597>   DW_AT_name        : (strp) (offset: 0x119f): tp_alloc
+    <59b>   DW_AT_decl_file   : (data1) 11
+    <59c>   DW_AT_decl_line   : (data1) 242
+    <59d>   DW_AT_decl_column : (data1) 15
+    <59e>   DW_AT_type        : (ref4) <0x9b4>, allocfunc, PyObject, _object
+    <5a2>   DW_AT_data_member_location: (data2) 304
+ <2><5a4>: Abbrev Number: 17 (DW_TAG_member)
+    <5a5>   DW_AT_name        : (strp) (offset: 0xfb2): tp_new
+    <5a9>   DW_AT_decl_file   : (data1) 11
+    <5aa>   DW_AT_decl_line   : (data1) 243
+    <5ab>   DW_AT_decl_column : (data1) 13
+    <5ac>   DW_AT_type        : (ref4) <0x989>, newfunc, PyObject, _object
+    <5b0>   DW_AT_data_member_location: (data2) 312
+ <2><5b2>: Abbrev Number: 17 (DW_TAG_member)
+    <5b3>   DW_AT_name        : (strp) (offset: 0x4f9): tp_free
+    <5b7>   DW_AT_decl_file   : (data1) 11
+    <5b8>   DW_AT_decl_line   : (data1) 244
+    <5b9>   DW_AT_decl_column : (data1) 14
+    <5ba>   DW_AT_type        : (ref4) <0x852>, freefunc
+    <5be>   DW_AT_data_member_location: (data2) 320
+ <2><5c0>: Abbrev Number: 17 (DW_TAG_member)
+    <5c1>   DW_AT_name        : (strp) (offset: 0x183): tp_is_gc
+    <5c5>   DW_AT_decl_file   : (data1) 11
+    <5c6>   DW_AT_decl_line   : (data1) 245
+    <5c7>   DW_AT_decl_column : (data1) 13
+    <5c8>   DW_AT_type        : (ref4) <0x71d>, inquiry, int
+    <5cc>   DW_AT_data_member_location: (data2) 328
+ <2><5ce>: Abbrev Number: 17 (DW_TAG_member)
+    <5cf>   DW_AT_name        : (strp) (offset: 0x264): tp_bases
+    <5d3>   DW_AT_decl_file   : (data1) 11
+    <5d4>   DW_AT_decl_line   : (data1) 246
+    <5d5>   DW_AT_decl_column : (data1) 15
+    <5d6>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <5da>   DW_AT_data_member_location: (data2) 336
+ <2><5dc>: Abbrev Number: 17 (DW_TAG_member)
+    <5dd>   DW_AT_name        : (strp) (offset: 0x129a): tp_mro
+    <5e1>   DW_AT_decl_file   : (data1) 11
+    <5e2>   DW_AT_decl_line   : (data1) 247
+    <5e3>   DW_AT_decl_column : (data1) 15
+    <5e4>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <5e8>   DW_AT_data_member_location: (data2) 344
+ <2><5ea>: Abbrev Number: 17 (DW_TAG_member)
+    <5eb>   DW_AT_name        : (strp) (offset: 0x1c01): tp_cache
+    <5ef>   DW_AT_decl_file   : (data1) 11
+    <5f0>   DW_AT_decl_line   : (data1) 248
+    <5f1>   DW_AT_decl_column : (data1) 15
+    <5f2>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <5f6>   DW_AT_data_member_location: (data2) 352
+ <2><5f8>: Abbrev Number: 17 (DW_TAG_member)
+    <5f9>   DW_AT_name        : (strp) (offset: 0x1858): tp_subclasses
+    <5fd>   DW_AT_decl_file   : (data1) 11
+    <5fe>   DW_AT_decl_line   : (data1) 249
+    <5ff>   DW_AT_decl_column : (data1) 15
+    <600>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <604>   DW_AT_data_member_location: (data2) 360
+ <2><606>: Abbrev Number: 17 (DW_TAG_member)
+    <607>   DW_AT_name        : (strp) (offset: 0x15ae): tp_weaklist
+    <60b>   DW_AT_decl_file   : (data1) 11
+    <60c>   DW_AT_decl_line   : (data1) 250
+    <60d>   DW_AT_decl_column : (data1) 15
+    <60e>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <612>   DW_AT_data_member_location: (data2) 368
+ <2><614>: Abbrev Number: 17 (DW_TAG_member)
+    <615>   DW_AT_name        : (strp) (offset: 0x107e): tp_del
+    <619>   DW_AT_decl_file   : (data1) 11
+    <61a>   DW_AT_decl_line   : (data1) 251
+    <61b>   DW_AT_decl_column : (data1) 16
+    <61c>   DW_AT_type        : (ref4) <0x86f>, destructor
+    <620>   DW_AT_data_member_location: (data2) 376
+ <2><622>: Abbrev Number: 17 (DW_TAG_member)
+    <623>   DW_AT_name        : (strp) (offset: 0x16e2): tp_version_tag
+    <627>   DW_AT_decl_file   : (data1) 11
+    <628>   DW_AT_decl_line   : (data1) 254
+    <629>   DW_AT_decl_column : (data1) 18
+    <62a>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+    <62e>   DW_AT_data_member_location: (data2) 384
+ <2><630>: Abbrev Number: 18 (DW_TAG_member)
+    <631>   DW_AT_name        : (strp) (offset: 0x80a): tp_finalize
+    <635>   DW_AT_decl_file   : (data1) 11
+    <636>   DW_AT_decl_line   : (data2) 256
+    <638>   DW_AT_decl_column : (data1) 16
+    <639>   DW_AT_type        : (ref4) <0x86f>, destructor
+    <63d>   DW_AT_data_member_location: (data2) 392
+ <2><63f>: Abbrev Number: 18 (DW_TAG_member)
+    <640>   DW_AT_name        : (strp) (offset: 0x16c9): tp_vectorcall
+    <644>   DW_AT_decl_file   : (data1) 11
+    <645>   DW_AT_decl_line   : (data2) 257
+    <647>   DW_AT_decl_column : (data1) 20
+    <648>   DW_AT_type        : (ref4) <0xaf5>, vectorcallfunc, PyObject, _object
+    <64c>   DW_AT_data_member_location: (data2) 400
+ <2><64e>: Abbrev Number: 18 (DW_TAG_member)
+    <64f>   DW_AT_name        : (strp) (offset: 0x1a1c): tp_print
+    <653>   DW_AT_decl_file   : (data1) 11
+    <654>   DW_AT_decl_line   : (data2) 260
+    <656>   DW_AT_decl_column : (data1) 30
+    <657>   DW_AT_type        : (ref4) <0xf41>, int
+    <65b>   DW_AT_data_member_location: (data2) 408
+ <2><65d>: Abbrev Number: 0
+ <1><65e>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <65f>   DW_AT_byte_size   : (data1) 8
+    <660>   DW_AT_type        : (ref4) <0x3ae>, _typeobject
+ <1><664>: Abbrev Number: 2 (DW_TAG_typedef)
+    <665>   DW_AT_name        : (strp) (offset: 0xda8): PyObject
+    <669>   DW_AT_decl_file   : (data1) 2
+    <66a>   DW_AT_decl_line   : (data1) 108
+    <66b>   DW_AT_decl_column : (data1) 3
+    <66c>   DW_AT_type        : (ref4) <0x386>, _object
+ <1><670>: Abbrev Number: 19 (DW_TAG_structure_type)
+    <671>   DW_AT_byte_size   : (data1) 24
+    <672>   DW_AT_decl_file   : (data1) 2
+    <673>   DW_AT_decl_line   : (data1) 113
+    <674>   DW_AT_decl_column : (data1) 9
+    <675>   DW_AT_sibling     : (ref4) <0x694>
+ <2><679>: Abbrev Number: 9 (DW_TAG_member)
+    <67a>   DW_AT_name        : (strp) (offset: 0x62c): ob_base
+    <67e>   DW_AT_decl_file   : (data1) 2
+    <67f>   DW_AT_decl_line   : (data1) 114
+    <680>   DW_AT_decl_column : (data1) 14
+    <681>   DW_AT_type        : (ref4) <0x664>, PyObject, _object
+    <685>   DW_AT_data_member_location: (data1) 0
+ <2><686>: Abbrev Number: 9 (DW_TAG_member)
+    <687>   DW_AT_name        : (strp) (offset: 0x983): ob_size
+    <68b>   DW_AT_decl_file   : (data1) 2
+    <68c>   DW_AT_decl_line   : (data1) 115
+    <68d>   DW_AT_decl_column : (data1) 16
+    <68e>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <692>   DW_AT_data_member_location: (data1) 16
+ <2><693>: Abbrev Number: 0
+ <1><694>: Abbrev Number: 2 (DW_TAG_typedef)
+    <695>   DW_AT_name        : (strp) (offset: 0x53b): PyVarObject
+    <699>   DW_AT_decl_file   : (data1) 2
+    <69a>   DW_AT_decl_line   : (data1) 116
+    <69b>   DW_AT_decl_column : (data1) 3
+    <69c>   DW_AT_type        : (ref4) <0x670>
+ <1><6a0>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6a1>   DW_AT_name        : (strp) (offset: 0x1302): unaryfunc
+    <6a5>   DW_AT_decl_file   : (data1) 2
+    <6a6>   DW_AT_decl_line   : (data1) 140
+    <6a7>   DW_AT_decl_column : (data1) 22
+    <6a8>   DW_AT_type        : (ref4) <0x6ac>, PyObject, _object
+ <1><6ac>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6ad>   DW_AT_byte_size   : (data1) 8
+    <6ae>   DW_AT_type        : (ref4) <0x6b2>, PyObject, _object
+ <1><6b2>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <6b3>   DW_AT_prototyped  : (flag_present) 1
+    <6b3>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <6b7>   DW_AT_sibling     : (ref4) <0x6c1>
+ <2><6bb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6bc>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><6c0>: Abbrev Number: 0
+ <1><6c1>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6c2>   DW_AT_byte_size   : (data1) 8
+    <6c3>   DW_AT_type        : (ref4) <0x664>, PyObject, _object
+ <1><6c7>: Abbrev Number: 7 (DW_TAG_const_type)
+    <6c8>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <1><6cc>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6cd>   DW_AT_name        : (strp) (offset: 0xa7b): binaryfunc
+    <6d1>   DW_AT_decl_file   : (data1) 2
+    <6d2>   DW_AT_decl_line   : (data1) 141
+    <6d3>   DW_AT_decl_column : (data1) 22
+    <6d4>   DW_AT_type        : (ref4) <0x6d8>, PyObject, _object
+ <1><6d8>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6d9>   DW_AT_byte_size   : (data1) 8
+    <6da>   DW_AT_type        : (ref4) <0x6de>, PyObject, _object
+ <1><6de>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <6df>   DW_AT_prototyped  : (flag_present) 1
+    <6df>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <6e3>   DW_AT_sibling     : (ref4) <0x6f2>
+ <2><6e7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6e8>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><6ec>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6ed>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><6f1>: Abbrev Number: 0
+ <1><6f2>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6f3>   DW_AT_name        : (strp) (offset: 0x620): ternaryfunc
+    <6f7>   DW_AT_decl_file   : (data1) 2
+    <6f8>   DW_AT_decl_line   : (data1) 142
+    <6f9>   DW_AT_decl_column : (data1) 22
+    <6fa>   DW_AT_type        : (ref4) <0x6fe>, PyObject, _object
+ <1><6fe>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6ff>   DW_AT_byte_size   : (data1) 8
+    <700>   DW_AT_type        : (ref4) <0x704>, PyObject, _object
+ <1><704>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <705>   DW_AT_prototyped  : (flag_present) 1
+    <705>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <709>   DW_AT_sibling     : (ref4) <0x71d>
+ <2><70d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <70e>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><712>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <713>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><717>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <718>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><71c>: Abbrev Number: 0
+ <1><71d>: Abbrev Number: 2 (DW_TAG_typedef)
+    <71e>   DW_AT_name        : (strp) (offset: 0x13d0): inquiry
+    <722>   DW_AT_decl_file   : (data1) 2
+    <723>   DW_AT_decl_line   : (data1) 143
+    <724>   DW_AT_decl_column : (data1) 15
+    <725>   DW_AT_type        : (ref4) <0x729>, int
+ <1><729>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <72a>   DW_AT_byte_size   : (data1) 8
+    <72b>   DW_AT_type        : (ref4) <0x72f>, int
+ <1><72f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <730>   DW_AT_prototyped  : (flag_present) 1
+    <730>   DW_AT_type        : (ref4) <0x5f>, int
+    <734>   DW_AT_sibling     : (ref4) <0x73e>
+ <2><738>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <739>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><73d>: Abbrev Number: 0
+ <1><73e>: Abbrev Number: 2 (DW_TAG_typedef)
+    <73f>   DW_AT_name        : (strp) (offset: 0x51): lenfunc
+    <743>   DW_AT_decl_file   : (data1) 2
+    <744>   DW_AT_decl_line   : (data1) 144
+    <745>   DW_AT_decl_column : (data1) 22
+    <746>   DW_AT_type        : (ref4) <0x74a>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><74a>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <74b>   DW_AT_byte_size   : (data1) 8
+    <74c>   DW_AT_type        : (ref4) <0x750>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><750>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <751>   DW_AT_prototyped  : (flag_present) 1
+    <751>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <755>   DW_AT_sibling     : (ref4) <0x75f>
+ <2><759>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <75a>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><75e>: Abbrev Number: 0
+ <1><75f>: Abbrev Number: 2 (DW_TAG_typedef)
+    <760>   DW_AT_name        : (strp) (offset: 0xb42): ssizeargfunc
+    <764>   DW_AT_decl_file   : (data1) 2
+    <765>   DW_AT_decl_line   : (data1) 145
+    <766>   DW_AT_decl_column : (data1) 21
+    <767>   DW_AT_type        : (ref4) <0x76b>, PyObject, _object
+ <1><76b>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <76c>   DW_AT_byte_size   : (data1) 8
+    <76d>   DW_AT_type        : (ref4) <0x771>, PyObject, _object
+ <1><771>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <772>   DW_AT_prototyped  : (flag_present) 1
+    <772>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <776>   DW_AT_sibling     : (ref4) <0x785>
+ <2><77a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <77b>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><77f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <780>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <2><784>: Abbrev Number: 0
+ <1><785>: Abbrev Number: 2 (DW_TAG_typedef)
+    <786>   DW_AT_name        : (strp) (offset: 0x16b0): ssizeobjargproc
+    <78a>   DW_AT_decl_file   : (data1) 2
+    <78b>   DW_AT_decl_line   : (data1) 147
+    <78c>   DW_AT_decl_column : (data1) 14
+    <78d>   DW_AT_type        : (ref4) <0x791>, int
+ <1><791>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <792>   DW_AT_byte_size   : (data1) 8
+    <793>   DW_AT_type        : (ref4) <0x797>, int
+ <1><797>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <798>   DW_AT_prototyped  : (flag_present) 1
+    <798>   DW_AT_type        : (ref4) <0x5f>, int
+    <79c>   DW_AT_sibling     : (ref4) <0x7b0>
+ <2><7a0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7a1>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7a5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7a6>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <2><7aa>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7ab>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
  <2><7af>: Abbrev Number: 0
- <1><7b0>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7b1>   DW_AT_name        : (strp) (offset: 0xdf0): getattrofunc
+ <1><7b0>: Abbrev Number: 2 (DW_TAG_typedef)
+    <7b1>   DW_AT_name        : (strp) (offset: 0x975): objobjargproc
     <7b5>   DW_AT_decl_file   : (data1) 2
-    <7b6>   DW_AT_decl_line   : (data1) 159
-    <7b7>   DW_AT_decl_column : (data1) 21
-    <7b8>   DW_AT_type        : (ref4) <0x5d6>, PyObject, _object
- <1><7bc>: Abbrev Number: 5 (DW_TAG_typedef)
-    <7bd>   DW_AT_name        : (strp) (offset: 0x1aad): setattrfunc
-    <7c1>   DW_AT_decl_file   : (data1) 2
-    <7c2>   DW_AT_decl_line   : (data1) 160
-    <7c3>   DW_AT_decl_column : (data1) 15
-    <7c4>   DW_AT_type        : (ref4) <0x7c8>, int
- <1><7c8>: Abbrev Number: 9 (DW_TAG_pointer_type)
